lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t ULIM       : 20;           /*!< [19..0] Sets the upper limit for the window comparator.                   */
            uint32_t            : 12;
    } WULIM_b;
  } ;

  union {
    __IOM uint32_t WLLIM;                       /*!< (@ 0x00000030) Window Comparator Lower Limits                             */

    struct {
      __IOM uint32_t LLIM       : 20;           /*!< [19..0] Sets the lower limit for the window comparator.                   */
            uint32_t            : 12;
    } WLLIM_b;
  } ;

  union {
    __IOM uint32_t SCWLIM;                      /*!< (@ 0x00000034) Scale Window Comparator Limits                             */

    struct {
      __IOM uint32_t SCWLIMEN   : 1;            /*!< [0..0] Scale the window limits compare values per precision
                                                     mode. When set to 0x0 (default), the values in the 20-bit
                                                     limits registers will compare directly with the FIFO values
                                                     regardless of the precision mode the slot is configured
                                                     to. When set to 0x1, the compare values will be divided
                                                     by the difference in precision bits while performing the
                                                     window limit comparisons.                                                 */
            uint32_t            : 31;
    } SCWLIM_b;
  } ;

  union {
    __IOM uint32_t FIFO;                        /*!< (@ 0x00000038) The AUDADC FIFO Register contains up to 2 samples
                                                                    for a single channel (high and low gain
                                                                    PGA samples), each sample up to 12-bits.
                                                                    It also contains meta data in the form of
                                                                    which audio channel the sample(s) are from
                                                                    along with the PGA gain code for that sample
                                                                    pair. When no data is present, FIFO entry
                                                                    reads back as all 1s (0xFFFFFFFF).                         */

    struct {
      __IOM uint32_t METALO     : 4;            /*!< [3..0] Meta data about this sample which represents the lower
                                                     4 bits of the PGA gain code                                               */
      __IOM uint32_t LGDATA     : 12;           /*!< [15..4] Low-gain PGA sample data                                          */
      __IOM uint32_t METAHI     : 3;            /*!< [18..16] Meta data about this sample which represents the upper
                                                     3 bits of the PGA gain code                                               */
      __IOM uint32_t MIC        : 1;            /*!< [19..19] Which audio channel this data is from encoded as int(slot
                                                     number/2). In other words, this is 1 if data is from slots
                                                     2 or 3, or 0 if from slots 0 or 1.                                        */
      __IOM uint32_t HGDATA     : 12;           /*!< [31..20] High-gain PGA sample data                                        */
    } FIFO_b;
  } ;

  union {
    __IOM uint32_t FIFOPR;                      /*!< (@ 0x0000003C) This is a pop-on-read mirrored copy of the ADCFIFO
                                                                    register with the only difference being
                                                                    that reading this register will result in
                                                                    a simultaneous FIFO POP which is also achieved
                                                                    by writing to the ADCFIFO Register. Note:
                                                                    The DFIFORDEN bit must be set in the CFG
                                                                    register for the the destructive read to
                                                                    be enabled.                                                */

    struct {
      __IOM uint32_t METALOPR   : 4;            /*!< [3..0] Meta data about this sample which represents the lower
                                                     4 bits of the PGA gain code                                               */
      __IOM uint32_t LGDATAPR   : 12;           /*!< [15..4] Low-gain PGA sample data                                          */
      __IOM uint32_t METAHIPR   : 3;            /*!< [18..16] Meta data about this sample which represents the upper
                                                     3 bits of the PGA gain code                                               */
      __IOM uint32_t MICPR      : 1;            /*!< [19..19] Which audio channel this data is from encoded as int(slot
                                                     number/2). In other words, this is 1 if data is from slots
                                                     2 or 3, or 0 if from slots 0 or 1.                                        */
      __IOM uint32_t HGDATAPR   : 12;           /*!< [31..20] High-gain PGA sample data                                        */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< (@ 0x00000040) AUDADC-Internal Repeating Trigger Timer Configuration      */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< [9..0] Trigger counter count max, used as initial condition
                                                     to trigger. Also used repeatedly each time counter reaches
                                                     it to restart trigger timer at zero. To update this value,
                                                     first disable the INTTRIGTIMER by setting TIMEREN to DIS,
                                                     change TIMERMAX, and then reenable it INTTRIGTIMER by setting
                                                     TIMEREN to EN again.                                                      */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< [18..16] Configure number of divide-by-2 of clock source as
                                                     input to trigger counter. (Max value of 5.) A value of
                                                     0 in this register would not divide down the AUDADC input
                                                     clock. A value of 1 would divide the AUDADC input clock
                                                     frequency by 2. A value of 5 would divide the AUDADC input
                                                     clock frequency by 2^5 = 32. To update this value, first
                                                     disable the INTTRIGTIMER by setting TIMEREN to DIS, change
                                                     CLKDIV, and then reenable it INTTRIGTIMER by setting TIMEREN
                                                     to EN again.                                                              */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< [31..31] AUDADC-internal trigger timer enable.                            */
    } INTTRIGTIMER_b;
  } ;

  union {
    __IOM uint32_t FIFOSTAT;                    /*!< (@ 0x00000044) This register contains status of the data FIFO.            */

