lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t TSTMODEN   : 1;            /*!< [0..0] When set to 1, test mode is enabled                                */
      __IOM uint32_t DBLHORSCANEN : 1;          /*!< [1..1] When set to 1, double horizontal scan is enabled                   */
      __IOM uint32_t LVDSINTEN  : 1;            /*!< [2..2] When set to 1, LVDS interface is enabled                           */
      __IOM uint32_t YUYVEN     : 1;            /*!< [3..3] When set to 1, the following output color formats are
                                                     enabled : Byte-3 beat Interface enabled, Byte-4 beat (RGBX)
                                                     Interface enabled, Two phase serial 12-bit enabled, YUYV
                                                     (16-bit mode) enabled, BT.656 enabled, JDI MIP enabled                    */
      __IOM uint32_t DBITYPEBEN : 1;            /*!< [4..4] When set to 1, DBI Type-B interface is enabled                     */
      __IOM uint32_t DISPFMT    : 4;            /*!< [8..5] Display data format                                                */
      __IOM uint32_t COLFMT     : 1;            /*!< [9..9] Output color format:                                               */
      __IOM uint32_t LVDSPADSEN : 1;            /*!< [10..10] When set to 1, LVDS output pads are enabled                      */
      __IOM uint32_t PLLCLKNDIV : 1;            /*!< [11..11] When set to 1, PLL_CLK is not divided                            */
      __IOM uint32_t RSVD0      : 5;            /*!< [16..12] This field is reserved.                                          */
      __IOM uint32_t FRAMEUPDTEN : 1;           /*!< [17..17] When set to 1, single frame update is enabled                    */
      __IOM uint32_t RSVD1      : 1;            /*!< [18..18] This field is reserved.                                          */
      __IOM uint32_t BLANKFRC   : 1;            /*!< [19..19] When set to 1, forces output to blank                            */
      __IOM uint32_t GAMARAMPEN : 1;            /*!< [20..20] When set to 1, gamma ramp is enabled                             */
      __IOM uint32_t RSVD2      : 1;            /*!< [21..21] This field is reserved.                                          */
      __IOM uint32_t PIXCLKPOL  : 1;            /*!< [22..22] Defines Pixel Clock out polarity                                 */
      __IOM uint32_t VSYNCEN    : 1;            /*!< [23..23] When set to 1, VSYNC for a single cycle per line is
                                                     enabled                                                                   */
      __IOM uint32_t DITHEREN   : 1;            /*!< [24..24] When set to 1, dithering is enabled                              */
      __IOM uint32_t RSVD3      : 1;            /*!< [25..25] This field is reserved.                                          */
      __IOM uint32_t DEPOL      : 1;            /*!< [26..26] Defines DE polarity                                              */
      __IOM uint32_t HSYNCPOL   : 1;            /*!< [27..27] Defines HSYNC polarity                                           */
      __IOM uint32_t VSYNCPOL   : 1;            /*!< [28..28] Defines VSYNC polarity                                           */
      __IOM uint32_t RSVD4      : 1;            /*!< [29..29] This field is reserved.                                          */
      __IOM uint32_t CUSOREN    : 1;            /*!< [30..30] When set to 1, programmable cursor is enabled                    */
      __IOM uint32_t DC400ACT   : 1;            /*!< [31..31] When set to 1, the dc400 controller is activated                 */
    } MODE_b;
  } ;

  union {
    __IOM uint32_t CLKCTRL;                     /*!< (@ 0x00000004) Setup proper timing with divisor control bits
                                                                    and specify the number of lines to be prefetched
                                                                    before the start of frame.                                 */

    struct {
      __IOM uint32_t DIVIDEVALUE : 6;           /*!< [5..0] Value of first clock divider                                       */
      __IOM uint32_t RSVD0      : 2;            /*!< [7..6] This field is reserved.                                            */
      __IOM uint32_t LINENUM    : 6;            /*!< [13..8] Number of lines to be prefetched before starting the
                                                     frame through DMA. Maximum value is 32                                    */
      __IOM uint32_t RSVD1      : 2;            /*!< [15..14] This field is reserved.                                          */
      __IOM uint32_t PLL        : 8;            /*!< [23..16] Select PLL Clock                                                 */
      __IOM uint32_t LVDS       : 3;            /*!< [26..24] Clock phase shift value for LVDS operation                       */
      __IOM uint32_t SECCLKDIV  : 5;            /*!< [31..27] Value of secondary clock divider                                 */
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t BGCOLOR;                     /*!< (@ 0x00000008) Specifies the main background color.                       */

    struct {
      __IOM uint32_t ALPHACOLOR : 8;            /*!< [7..0] Color alpha is used as background color                            */
      __IOM uint32_t BLUECOLOR  : 8;            /*!< [15..8] Color blue is used as background color                            */
      __IOM uint32_t GREENCOLOR : 8;            /*!< [23..16] Color green is used as background color                          */
      __IOM uint32_t REDCOLOR   : 8;            /*!< [31..24] Color red is used as background color                            */
    } BGCOLOR_b;
  } ;

  union {
    __IOM uint32_t RESXY;                       /*!< (@ 0x0000000C) Specifies the main X and Y resolutions.                    */

