lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t CURLUT0B   : 8;            /*!< [7..0] Cursor LUT blue bits                                               */
      __IOM uint32_t CURLUT0G   : 8;            /*!< [15..8] Cursor LUT green bits                                             */
      __IOM uint32_t CURLUT0R   : 8;            /*!< [23..16] Cursor LUT red bits                                              */
            uint32_t            : 8;
    } CURSORLUT_b;
  } ;
  __IM  uint32_t  RESERVED7[383];

  union {
    __IOM uint32_t L0LUT;                       /*!< (@ 0x00001000) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255].
                                                                    Layer 0 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.                       */

    struct {
      __IOM uint32_t L0LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L0LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L0LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L0LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L0LUT_b;
  } ;
  __IM  uint32_t  RESERVED8[255];

  union {
    __IOM uint32_t L1LUT;                       /*!< (@ 0x00001400) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 1 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L1LUT(n) (*((volatile uint32_t*)(&L1LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L1LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L1LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L1LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L1LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L1LUT_b;
  } ;
  __IM  uint32_t  RESERVED9[255];

  union {
    __IOM uint32_t L2LUT0;                      /*!< (@ 0x00001800) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 2 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L2LUT(n) (*((volatile uint32_t*)(&L2LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L2LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L2LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L2LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L2LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L2LUT0_b;
  } ;
  __IM  uint32_t  RESERVED10[255];

  union {
    __IOM uint32_t L3LUT;                       /*!< (@ 0x00001C00) A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]
                                                                    Layer 3 palette,gamma correction memory
                                                                    region where x starts at 0 thru 255.Access
                                                                    to all 256 registers is best accomplished
                                                                    by passing an index via a macro. e.g. pseudocode
                                                                    #define DC_L3LUT(n) (*((volatile uint32_t*)(&L3LUT
                                                                    + (4*n))))                                                 */

    struct {
      __IOM uint32_t L3LUT0GAMRAMPB : 8;        /*!< [7..0] Gamma ramp blue bits                                               */
      __IOM uint32_t L3LUT0GAMRAMPG : 8;        /*!< [15..8] Gamma ramp green bits                                             */
      __IOM uint32_t L3LUT0GAMRAMPR : 8;        /*!< [23..16] Gamma ramp red bits                                              */
      __IOM uint32_t L3LUT0GAMRAMPA : 8;        /*!< [31..24] Gamma ramp alpha bits                                            */
    } L3LUT_b;
  } ;
} DC_Type;                                      /*!< Size = 7172 (0x1c04)                                                      */



/* =========================================================================================================================== */
/* ================                                            DSI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital Serial Interface Unit (DSI)
  */

