lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t SHUTDOWN   : 1;            /*!< [0..0] Set to 1 to indicate a shut down short packet has to
                                                     be packetised for the DPIs virtual channel                                */
      __IOM uint32_t TURNON1    : 1;            /*!< [1..1] Set to 1 to indicate a Turn ON short packet has to be
                                                     packetised for the DPIs virtual channel                                   */
      __IOM uint32_t COLOR      : 1;            /*!< [2..2] MODEON Set to 1 to indicate a color Mode ON short packet
                                                     has to be packetised for the DPIs virtual channel.                        */
      __IOM uint32_t COLORMODEOFF : 1;          /*!< [3..3] Set to 1 to indicate a Color Mode OFF short packet has
                                                     to be packetised for the DPIs virtual channel                             */
            uint32_t            : 28;
    } DPI_b;
  } ;

  union {
    __IOM uint32_t PLLLOCKCNT;                  /*!< (@ 0x0000004C) The PLL counter value                                      */

    struct {
      __IOM uint32_t PLLCNTVAL  : 16;           /*!< [15..0] Pll counter value in terms of low power clock.                    */
            uint32_t            : 16;
    } PLLLOCKCNT_b;
  } ;

  union {
    __IOM uint32_t INITCNT;                     /*!< (@ 0x00000050) Count register to initialize the DSI HOST IP               */

    struct {
      __IOM uint32_t MSTR       : 16;           /*!< [15..0] Counter value in terms of low power clock to initialise
                                                     the DSI Host IP (TINIT) that drives a stop state on the
                                                     mipis D-PHY bus; DPHY Initialization period min 100 x B5s;
                                                     Time out value is calculated by txclkesc and the count
                                                     value is 7d0h(2000 in decimal)                                            */
            uint32_t            : 16;
    } INITCNT_b;
  } ;

  union {
    __IOM uint32_t MAXRETPACSZE;                /*!< (@ 0x00000054) MAXRETPACSZE register description needed here.             */

    struct {
      __IOM uint32_t COUNTVAL   : 11;           /*!< [10..0] Set the count value in bytes to collect the return data
                                                     packet for reverse direction data flow in data lane0 in
                                                     response to a DBI read operation; Count value equals the
                                                     maximum size of the payload in a Long packet transmitted
                                                     from peripheral back to; for DBI and DPI interleaving Min
                                                     value - 1; Max value - Maximum payload for a long packet
                                                     size is 1K bytes Note: DCS short Read Response or Long
                                                     read response with 1 or 2 parameters is applicable in this
                                                     mode; For DBI only, Min value - 1 Max value - Maximum pa                  */
            uint32_t            : 4;
      __IOM uint32_t HSLP       : 1;            /*!< [15..15] Indicates the data transfer type                                 */
            uint32_t            : 16;
    } MAXRETPACSZE_b;
  } ;

  union {
    __IOM uint32_t VIDEOMODEFMT;                /*!< (@ 0x00000058) Sets the Video mode format (packet sequence)
                                                                    to be supported in DSI.                                    */

    struct {
      __IOM uint32_t VIDEMDFMT  : 2;            /*!< [1..0] Sets the Video mode format (packet sequence) to be supported
                                                     in DSI; in Non Burst Mode, in addition to programming this
                                                     register the horizontal active area count register value
                                                     should also be programmed equal to RGB word count value;
                                                     in Burst Mode, in addition to programming this register
                                                     the horizontal active area count register value should
                                                     also be programmed greater than the RGB word count value,
                                                     leaving more time during a scan line for LP mode (saving
                                                     power) or for multiplexing other transmissions onto                       */
            uint32_t            : 30;
    } VIDEOMODEFMT_b;
  } ;

  union {
    __IOM uint32_t CLKEOT;                      /*!< (@ 0x0000005C) The EOT clock register disables the video.                 */

    struct {
      __IOM uint32_t EOT        : 1;            /*!< [0..0] Set by the processor to enable or disable EOT short disable_register
                                                     packet transmission; vy default this register value is
                                                     0; for backward compatibility of earlier DSI systems, EOT
                                                     short packet transmission can be disabled; 0 EOT short
                                                     packet transmission enabled, 1 EOT short packet transmission
                                                     disabled                                                                  */
      __IOM uint32_t CLOCK      : 1;            /*!< [1..1] Set by the processor to enable or disable clock; Stopping
                                                     feature during BLLP timing in a DPI transfer in dual channel
                                                     mode or during DPI only mode and also when there is no
                                                     traffic in the DBI interface in DBI only enabled mode.
                                                     By default this register value is 0.                                      */
      __IOM uint32_t BTA        : 1;            /*!< [2..2] Disable video; Set by the processor to inform the DSI
                                                     controller to disable the BTA sent at the last blanking
                                                     line of VFP. By default, this bit is set to 0; 0 BTA sending
                                                     at the last blanking line of VFP is enabled; 1 BTA sending
                                                     at the last blanking line of VFP is disabled                              */
            uint32_t            : 29;
    } CLKEOT_b;
  } ;

  union {
    __IOM uint32_t POLARITY;                    /*!< (@ 0x00000060) Polarity Register                                          */

