lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (0,2). matrix floating point element.                             */
    } MM02_b;
  } ;

  union {
    __IOM uint32_t MM10;                        /*!< (@ 0x0000016C) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (1,0). matrix floating point element.                             */
    } MM10_b;
  } ;

  union {
    __IOM uint32_t MM11;                        /*!< (@ 0x00000170) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (1,1). matrix floating point element                              */
    } MM11_b;
  } ;

  union {
    __IOM uint32_t MM12;                        /*!< (@ 0x00000174) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (1,2). matrix floating point element.                             */
    } MM12_b;
  } ;

  union {
    __IOM uint32_t MM20;                        /*!< (@ 0x00000178) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (2,0). matrix floating point element.                             */
    } MM20_b;
  } ;

  union {
    __IOM uint32_t MM21;                        /*!< (@ 0x0000017C) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (2,1). matrix floating point element.                             */
    } MM21_b;
  } ;

  union {
    __IOM uint32_t MM22;                        /*!< (@ 0x00000180) matrix floating point element.                             */

    struct {
      __IOM uint32_t MTX        : 32;           /*!< [31..0] (2,2). matrix floating point element                              */
    } MM22_b;
  } ;

  union {
    __IOM uint32_t DEPTHSTARTL;                 /*!< (@ 0x00000184) Depth value of START pixel, (32 low bits fractional.)      */

    struct {
      __IOM uint32_t DEPTH32LO  : 32;           /*!< [31..0] Depth value of START pixel                                        */
    } DEPTHSTARTL_b;
  } ;

  union {
    __IOM uint32_t DEPTHSTARTH;                 /*!< (@ 0x00000188) Depth value of START pixel, (32 high bits integral.)       */

    struct {
      __IOM uint32_t DEPTH32HI  : 32;           /*!< [31..0] Depth value of START pixel                                        */
    } DEPTHSTARTH_b;
  } ;

  union {
    __IOM uint32_t DEPTHDXL;                    /*!< (@ 0x0000018C) Added depth value for each step at x-axis (32
                                                                    low bits fractional.)                                      */

    struct {
      __IOM uint32_t XAXISLO    : 32;           /*!< [31..0] Added depth value for each step at x-axis                         */
    } DEPTHDXL_b;
  } ;

  union {
    __IOM uint32_t DEPTHDXH;                    /*!< (@ 0x00000190) Added depth value for each step at x-axis (32
                                                                    high bits integral.)                                       */

    struct {
      __IOM uint32_t XAXISHI    : 32;           /*!< [31..0] Added depth value for each step at x-axis                         */
    } DEPTHDXH_b;
  } ;

  union {
    __IOM uint32_t DEPTHDYL;                    /*!< (@ 0x00000194) Added depth value for each step at y-axis (32
                                                                    low bits fractional.)                                      */

    struct {
      __IOM uint32_t YAXISLO    : 32;           /*!< [31..0] Added depth value for each step at y-axis                         */
    } DEPTHDYL_b;
  } ;

  union {
    __IOM uint32_t DEPTHDYH;                    /*!< (@ 0x00000198) Added depth value for each step at y-axis (32
                                                                    high bits integral.)                                       */

    struct {
      __IOM uint32_t YAXISHI    : 32;           /*!< [31..0] Added depth value for each step at y-axis                         */
    } DEPTHDYH_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t REDX;                        /*!< (@ 0x000001A0) Added red value for each step at x-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t REDX       : 32;           /*!< [31..0] Added red value for each step at x-axis                           */
    } REDX_b;
  } ;

  union {
    __IOM uint32_t REDY;                        /*!< (@ 0x000001A4) Added red value for each step at y-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t REDY       : 32;           /*!< [31..0] red value for each step at y-axis                                 */
    } REDY_b;
  } ;

  union {
    __IOM uint32_t GREENX;                      /*!< (@ 0x000001A8) Added green value for each step at x-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t GREENX     : 32;           /*!< [31..0] Added green value for each step at x-axis                         */
    } GREENX_b;
  } ;

  union {
    __IOM uint32_t GREENY;                      /*!< (@ 0x000001AC) Added green value for each step at y-axis, (16,
                                                                    16 fixed point)                                            */

    struct {
      __IOM uint32_t GREENY     : 32;           /*!< [31..0] Added green value for each step at y-axis                         */
    } GREENY_b;
  } ;

  union {
    __IOM uint32_t BLUEX;                       /*!< (@ 0x000001B0) Added blue value for each step at x-axis, (16,
                                                                    16 fixed point)                                            */

