lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t VDDCRXCOMPEN : 1;          /*!< [0..0] Enable the VDDC rail.                                              */
      __IOM uint32_t VDDFRXCOMPEN : 1;          /*!< [1..1] Enable the VDDS rail.                                              */
      __IOM uint32_t VDDSRXCOMPEN : 1;          /*!< [2..2] Enable the VDDS rail.                                              */
      __IOM uint32_t VDDCLVRXCOMPEN : 1;        /*!< [3..3] Enable the VDDC LV rail.                                           */
      __IOM uint32_t TONTOFFNODEGLITCH : 1;     /*!< [4..4] Enable the ton and toff signals no deglitch output.                */
            uint32_t            : 27;
    } SIMOBUCK0_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK1;                   /*!< (@ 0x00000340) 1. Control the even division of 3 clocks: refresh,
                                                                    low power and TONCLK. 2. Control gap bewteen
                                                                    secondary switches. 3. Debug features: control
                                                                    the amount of time TONCLK is on, and the
                                                                    time before snubber asserts for each buck
                                                                    sequence. 4. Enable or disable the observation
                                                                    bus. 5. Select the buck sequence operation
                                                                    mode. 6. Control delay between primary Pmos
                                                                    and Nmos transitions.                                      */

    struct {
            uint32_t            : 6;
      __IOM uint32_t SIMOBUCKRXCLKACTTRIM : 5;  /*!< [10..6] This divides the 5 MHz refresh clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 11;
      __IOM uint32_t SIMOBUCKTONCLKTRIM : 4;    /*!< [25..22] This divides the 100 MHz ton clock. Even divides are
                                                     supported only. This value represents the division amount
                                                     minus 1.                                                                  */
            uint32_t            : 6;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< (@ 0x00000344) SIMO Buck Muxed VDDC Active Sequence Trim Control          */

    struct {
            uint32_t            : 11;
      __IOM uint32_t SIMOBUCKVDDCACTHIGHTONTRIM : 4;/*!< [14..11] VDDC active high ton trim control for Buck sequence.         */
            uint32_t            : 9;
      __IOM uint32_t SIMOBUCKVDDCACTLOWTONTRIM : 4;/*!< [27..24] VDDC active high ton trim control for Buck sequence.          */
            uint32_t            : 4;
    } SIMOBUCK2_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK3;                   /*!< (@ 0x00000348) SIMO Buck Muxed VDDC low power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 2;
      __IOM uint32_t SIMOBUCKVDDCLPDRVSTRTRIM : 2;/*!< [3..2] VDDC LP trim control for drive strength.                         */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDCLPHIGHTOFFTRIM : 5;/*!< [12..8] VDDC LP high toff trim control for Buck sequence.             */
      __IOM uint32_t SIMOBUCKVDDCLPHIGHTONTRIM : 4;/*!< [16..13] VDDC LP high ton trim control for Buck sequence.              */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDCLPLOWTOFFTRIM : 5;/*!< [25..21] VDDC LP low toff trim control for Buck sequence.              */
      __IOM uint32_t SIMOBUCKVDDCLPLOWTONTRIM : 4;/*!< [29..26] VDDC LP low ton trim control for Buck sequence.                */
            uint32_t            : 2;
    } SIMOBUCK3_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK4;                   /*!< (@ 0x0000034C) SIMO Buck Muxed VDDC LV Active Sequence Trim
                                                                    Control                                                    */

    struct {
      __IOM uint32_t VDDCLVACTDRVSTRTRIM : 2;   /*!< [1..0] VDDC LV active trim control for drive strength.                    */
            uint32_t            : 4;
      __IOM uint32_t VDDCLVACTHIGHTOFFTRIM : 5; /*!< [10..6] VDDC LV active high toff trim control for Buck sequence.          */
      __IOM uint32_t VDDCLVACTHIGHTONTRIM : 4;  /*!< [14..11] VDDC LV active high ton trim control for Buck sequence.          */
            uint32_t            : 4;
      __IOM uint32_t VDDCLVACTLOWTOFFTRIM : 5;  /*!< [23..19] VDDC LV active low trim control for a 500 MHz clock
                                                     inside the simobuck analog design.                                        */
      __IOM uint32_t VDDCLVACTLOWTONTRIM : 4;   /*!< [27..24] VDDC LV active low ton trim control for Buck sequence.           */
            uint32_t            : 4;
    } SIMOBUCK4_b;
  } ;
  __IM  uint32_t  RESERVED18;

  union {
    __IOM uint32_t SIMOBUCK6;                   /*!< (@ 0x00000354) SIMO Buck Muxed VDDF Active Sequence Trim Control          */

    struct {
            uint32_t            : 17;
      __IOM uint32_t SIMOBUCKVDDFACTHIGHTONTRIM : 4;/*!< [20..17] VDDF active high ton trim control for Buck sequence.         */
            uint32_t            : 11;
    } SIMOBUCK6_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK7;                   /*!< (@ 0x00000358) SIMO Buck Muxed VDDF active Sequence Trim Control          */

