lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t VDDFACTLOWTOFFTRIM : 5;    /*!< [8..4] VDDF active low toff trim control for Buck sequence.               */
      __IOM uint32_t VDDFACTLOWTONTRIM : 4;     /*!< [12..9] VDDF active low ton trim control for Buck sequence.               */
      __IOM uint32_t VDDFLPDRVSTRTRIM : 2;      /*!< [14..13] VDDF active trim control for drive strength.                     */
            uint32_t            : 3;
      __IOM uint32_t ZXCOMPZXTRIM : 5;          /*!< [22..18] Zxcomp trim. Feedthrough to analog.                              */
            uint32_t            : 9;
    } SIMOBUCK7_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK8;                   /*!< (@ 0x0000035C) SIMO Buck Muxed VDDF Low Power Sequence Trim
                                                                    Control                                                    */

    struct {
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDFLPHIGHTOFFTRIM : 5;/*!< [8..4] VDDF low power high toff trim control for Buck sequence.       */
      __IOM uint32_t SIMOBUCKVDDFLPHIGHTONTRIM : 4;/*!< [12..9] VDDF low power high ton trim control for Buck sequence.        */
            uint32_t            : 4;
      __IOM uint32_t SIMOBUCKVDDFLPLOWTOFFTRIM : 5;/*!< [21..17] VDDF low power low toff trim control for Buck sequence.       */
      __IOM uint32_t SIMOBUCKVDDFLPLOWTONTRIM : 4;/*!< [25..22] VDDF low power low ton trim control for Buck sequence.         */
            uint32_t            : 6;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< (@ 0x00000360) SIMO Buck Muxed VDDS Active Sequence Trim Control          */

    struct {
            uint32_t            : 17;
      __IOM uint32_t SIMOBUCKVDDSACTHIGHTONTRIM : 4;/*!< [20..17] VDDS active high ton trim control for Buck sequence.         */
            uint32_t            : 1;
      __IOM uint32_t SIMOBUCKVDDSACTLOWTONTRIM : 4;/*!< [25..22] VDDS active low ton trim control for Buck sequence.           */
            uint32_t            : 6;
    } SIMOBUCK9_b;
  } ;
  __IM  uint32_t  RESERVED19[2];

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< (@ 0x0000036C) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
      __IOM uint32_t VDDCLVCOMPTRIMMINUS : 5;   /*!< [4..0] Static trim to allow separation between low power and
                                                     active rail.                                                              */
      __IOM uint32_t VDDCLVCOMPTRIMPLUS : 5;    /*!< [9..5] Static trim to allow separation when low power GT active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCLVBRNOUTTRIM : 10;     /*!< [19..10] Digital brown out max counter value for VDDC LV rail.            */
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< [25..20] Active VDDF trim.                                                */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< [31..26] Low power VDDF trim.                                             */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< (@ 0x00000370) SIMO Buck Compare, Brown out, Active, Low power
                                                                    Trim Control                                               */

    struct {
            uint32_t            : 20;
      __IOM uint32_t SIMOBUCKACTTRIMVDDS : 6;   /*!< [25..20] Active VDDS trim.                                                */
      __IOM uint32_t SIMOBUCKLPTRIMVDDS : 6;    /*!< [31..26] Low power VDDS trim.                                             */
    } SIMOBUCK13_b;
  } ;
  __IM  uint32_t  RESERVED20;

  union {
    __IOM uint32_t SIMOBUCK15;                  /*!< (@ 0x00000378) SIMO Buck Compare, Brown out, Active and Low
                                                                    power Trim Control                                         */

    struct {
      __IOM uint32_t VDDCCOMPTRIMMINUS : 5;     /*!< [4..0] Static trim to allow separation between low power and
                                                     active rail.                                                              */
      __IOM uint32_t VDDCCOMPTRIMPLUS : 5;      /*!< [9..5] Static trim to allow separation when low power GT active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCBRNOUTTRIM : 10;       /*!< [19..10] Digital brown out max counter value for VDDC rail.               */
      __IOM uint32_t VDDCLVRXCOMPTRIMEN : 1;    /*!< [20..20] Enable the VDDC LV rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t VDDSRXCOMPTRIMEN : 1;      /*!< [21..21] Enable the VDDS rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t VDDFRXCOMPTRIMEN : 1;      /*!< [22..22] Enable the VDDF rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t VDDCRXCOMPTRIMEN : 1;      /*!< [23..23] Enable the VDDC rail. If not enabled, the rail will
                                                     not be regulated. This must be done before simobuck comes
                                                     up.                                                                       */
      __IOM uint32_t ZXCOMPOFFSETTRIM : 5;      /*!< [28..24] Zxcomp offset trim. Feedthrough to analog.                       */
            uint32_t            : 2;
      __IOM uint32_t TRIMLATCHOVER : 1;         /*!< [31..31] Override / Bypass the simobuck trim latch to enable
                                                     on-the-fly trimming for VDDF and VDDS active and LP trims                 */
    } SIMOBUCK15_b;
  } ;

  union {
    __IOM uint32_t PWRSW0;                      /*!< (@ 0x0000037C) PWRSW Control 0                                            */

