lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t DMARPROT1  : 16;           /*!< [15..0] Read protect SRAM from DMA. Each bit provides write
                                                     protection for an 8KB region of memory. When set to 1,
                                                     the region will be protected from DMA reads, when set to
                                                     0, DMA may read the region.                                               */
            uint32_t            : 16;
    } DMASRAMRPROT1_b;
  } ;
  __IM  uint32_t  RESERVED22[16];

  union {
    __IOM uint32_t USBPHYRESET;                 /*!< (@ 0x00000418) DSP0 CACHE RAM TRIM                                        */

    struct {
      __IOM uint32_t USBPHYPORRSTDIS : 1;       /*!< [0..0] De-assert USB PHY POR reset override                               */
      __IOM uint32_t USBPHYUTMIRSTDIS : 1;      /*!< [1..1] De-assert USB PHY UTMI reset override                              */
            uint32_t            : 30;
    } USBPHYRESET_b;
  } ;
  __IM  uint32_t  RESERVED23[4];

  union {
    __IOM uint32_t AUDADCPWRCTRL;               /*!< (@ 0x0000042C) Audio ADC Power Control                                    */

    struct {
      __IOM uint32_t AUDADCPWRCTRLSWE : 1;      /*!< [0..0] Audio ADC Power Control Software Override Enable                   */
      __IOM uint32_t AUDADCAPSEN : 1;           /*!< [1..1] Enable the Global audio ADC Power Switch on when set
                                                     to 1 if the AUDADCPWRCTRLSWE bit is set.                                  */
      __IOM uint32_t AUDADCBPSEN : 1;           /*!< [2..2] Enable the Analog, IO and SAR Digital logic Power Switch
                                                     on when set to 1 if the AUDADCPWRCTRLSWE bit is set.                      */
      __IOM uint32_t AUDBGTPEN  : 1;            /*!< [3..3] Bandgap and Temperature Sensor Power Switch Enable                 */
      __IOM uint32_t AUDREFBUFPEN : 1;          /*!< [4..4] Reference Buffer Power Switch Enable                               */
      __IOM uint32_t AUDREFKEEPPEN : 1;         /*!< [5..5] Reference Buffer Keeper Power Switch Enable                        */
            uint32_t            : 2;
      __IOM uint32_t VDDAUDADCSARISOLATE : 1;   /*!< [8..8] ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN
                                                     is switched off )                                                         */
      __IOM uint32_t VDDAUDADCDIGISOLATE : 1;   /*!< [9..9] ISOLATE signal for audio ADC Digital Contoller ( when
                                                     AUDADCAPSEN is switched off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
      __IOM uint32_t VDDAUDADCRESETN : 1;       /*!< [10..10] RESETN signal for Power Switched SAR and Digital Controller
                                                     (when global power switch is off and if the AUDADCPWRCTRLSWE
                                                     bit is set)                                                               */
            uint32_t            : 1;
      __IOM uint32_t AUDADCVBATDIVEN : 1;       /*!< [12..12] Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
            uint32_t            : 1;
      __IOM uint32_t AUDADCINBUFSEL : 2;        /*!< [15..14] Audio ADC input buffer mux select                                */
      __IOM uint32_t AUDADCINBUFEN : 1;         /*!< [16..16] Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE
                                                     bit is set )                                                              */
      __IOM uint32_t AUDADCRFBUFSLWEN : 1;      /*!< [17..17] Audio ADC reference buffer slew enable                           */
      __IOM uint32_t AUDADCKEEPOUTEN : 1;       /*!< [18..18] Audio ADC reference keeper out en                                */
            uint32_t            : 13;
    } AUDADCPWRCTRL_b;
  } ;

  union {
    __IOM uint32_t AUDIO1;                      /*!< (@ 0x00000430) Audio trims 1                                              */

    struct {
            uint32_t            : 6;
      __IOM uint32_t MICBIASVOLTAGETRIM : 6;    /*!< [11..6] Output voltage trim                                               */
      __IOM uint32_t MICBIASPDNB : 1;           /*!< [12..12] Power down control for the block                                 */
            uint32_t            : 19;
    } AUDIO1_b;
  } ;
  __IM  uint32_t  RESERVED24;

  union {
    __IOM uint32_t PGAADCIFCTRL;                /*!< (@ 0x00000438) PGA ADCIF control                                          */

    struct {
      __IOM uint32_t PGAADCIFCHAACTIVE : 2;     /*!< [1..0] PGAADCIF active signal for channels A0 and A1. Starts
                                                     and stops 2 clocks after demultiplexed SOC signal.                        */
      __IOM uint32_t PGAADCIFCHAPDNB : 2;       /*!< [3..2] Power down for channels A0 and A1 (0 = powered down;
                                                     1 = standby)                                                              */
      __IOM uint32_t PGAADCIFCHBACTIVE : 2;     /*!< [5..4] PGAADCIF active signal for channels B0 and B1. Starts
                                                     and stops 2 clocks after demultiplexed SOC signal.                        */
      __IOM uint32_t PGAADCIFCHBPDNB : 2;       /*!< [7..6] Power down for channels B0 and B1 (0 = powered down;
                                                     1 = standby)                                                              */
            uint32_t            : 4;
      __IOM uint32_t PGAADCIFVCOMPEN : 1;       /*!< [12..12] Enable for VCOMP output                                          */
      __IOM uint32_t PGAADCIFVCOMPSEL : 2;      /*!< [14..13] Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)             */
            uint32_t            : 17;
    } PGAADCIFCTRL_b;
  } ;

  union {
    __IOM uint32_t PGACTRL1;                    /*!< (@ 0x0000043C) PGA control 1                                              */

