lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t PGACHA0GAIN1SEL : 3;       /*!< [2..0] Channel A0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHA0GAIN2DIV2SEL : 1;   /*!< [3..3] Channel A0 PGA divide by two select (0: 0 dB, 1: -6dB),
                                                     needed for fully differential inputs                                      */
      __IOM uint32_t PGACHA0GAIN2SEL : 5;       /*!< [8..4] Channel A0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHA1GAIN1SEL : 3;       /*!< [11..9] Channel A1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHA1GAIN2DIV2SEL : 1;   /*!< [12..12] Channel A1 PGA divide by two select (0: 0 dB, 1: -6dB),
                                                     needed for fully differential inputs                                      */
      __IOM uint32_t PGACHA1GAIN2SEL : 5;       /*!< [17..13] Channel A1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5
                                                     dB steps)                                                                 */
      __IOM uint32_t PGACHABYPASSEN : 2;        /*!< [19..18] Bypass enable for Channels A0 and A1 (1: bypass, when
                                                     gain LT 12 dB; 0: otherwise)                                              */
      __IOM uint32_t PGACHAOPAMPINPDNB : 2;     /*!< [21..20] Channels A0 and A1 input stage opamp power down (0:
                                                     powered down, 1: powered up). Must be 1 when respective
                                                     PGACHABYPASSEN = 0.                                                       */
      __IOM uint32_t PGACHAOPAMPOUTPDNB : 2;    /*!< [23..22] Channels A0 and A1 output stage opamp power down (0:
                                                     powered down, 1: powered up)                                              */
      __IOM uint32_t PGACHAVCMGENPDNB : 1;      /*!< [24..24] Channel A VCMGEN power down (0: powered down, 1: powered
                                                     up)                                                                       */
      __IOM uint32_t PGACHAVCMGENQCHARGEEN : 1; /*!< [25..25] Channel A VCMGEN quick charge enable (pulsed during
                                                     channel powerup)                                                          */
      __IOM uint32_t PGAIREFGENPDNB : 1;        /*!< [26..26] IREFGEN power down (0: powered down, 1: powered up)              */
      __IOM uint32_t PGAVREFGENPDNB : 1;        /*!< [27..27] VREFGEN power down (0: powered down, 1: powered up)              */
      __IOM uint32_t PGAVREFGENQUICKSTARTEN : 1;/*!< [28..28] VREFGEN quick start enable (pulsed during startup)               */
      __IOM uint32_t VCOMPSELPGA : 1;           /*!< [29..29] Select for VCOMP output (0: A0, 1: A1, 2: B0, 3: B1)             */
            uint32_t            : 1;
      __IOM uint32_t PGAGAINAOVRD : 1;          /*!< [31..31] Apply BYPASS and GAIN bits from this register (for
                                                     channel A) instead of automatically via audio ADC. Note
                                                     that audio ADC FIFO meta data will not reflect dB gain
                                                     as used when configuring audio ADC.                                       */
    } PGACTRL1_b;
  } ;

  union {
    __IOM uint32_t PGACTRL2;                    /*!< (@ 0x00000440) PGA control 2                                              */

    struct {
      __IOM uint32_t PGACHB0GAIN1SEL : 3;       /*!< [2..0] Channel B0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHB0GAIN2DIV2SEL : 1;   /*!< [3..3] Channel B0 PGA divide by two select (0: 0 dB, 1: -6dB),
                                                     needed for fully differential inputs                                      */
      __IOM uint32_t PGACHB0GAIN2SEL : 5;       /*!< [8..4] Channel B0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHB1GAIN1SEL : 3;       /*!< [11..9] Channel B1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB
                                                     steps)                                                                    */
      __IOM uint32_t PGACHB1GAIN2DIV2SEL : 1;   /*!< [12..12] Channel B1 PGA divide by two select (0: 0 dB, 1: -6dB),
                                                     needed for fully differential inputs                                      */
      __IOM uint32_t PGACHB1GAIN2SEL : 5;       /*!< [17..13] Channel B1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5
                                                     dB steps)                                                                 */
      __IOM uint32_t PGACHBBYPASSEN : 2;        /*!< [19..18] Bypass enable for Channels B0 and B1 (1: bypass, when
                                                     gain LT 12 dB; 0: otherwise)                                              */
      __IOM uint32_t PGACHBOPAMPINPDNB : 2;     /*!< [21..20] Channels B0 and B1 input stage opamp power down (0:
                                                     powered down, 1: powered up). Must be 1 when respective
                                                     PGACHBBYPASSEN = 0.                                                       */
      __IOM uint32_t PGACHBOPAMPOUTPDNB : 2;    /*!< [23..22] Channels B0 and B1 output stage opamp power down (0:
                                                     powered down, 1: powered up)                                              */
      __IOM uint32_t PGACHBVCMGENPDNB : 1;      /*!< [24..24] Channel B VCMGEN power down (0: powered down, 1: powered
                                                     up)                                                                       */
      __IOM uint32_t PGACHBVCMGENQCHARGEEN : 1; /*!< [25..25] Channel B VCMGEN quick charge enable (pulsed during
                                                     channel powerup)                                                          */
            uint32_t            : 5;
      __IOM uint32_t PGAGAINBOVRD : 1;          /*!< [31..31] Apply BYPASS and GAIN bits from this register (for
                                                     channel B) instead of automatically via audio ADC. Note
                                                     that audio ADC FIFO meta data will not reflect dB gain
                                                     as used when configuring audio ADC.                                       */
    } PGACTRL2_b;
  } ;

  union {
    __IOM uint32_t AUDADCPWRDLY;                /*!< (@ 0x00000444) Audio ADC Power Up Delay Control                           */

