lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t DEVCFG0    : 4;            /*!< [3..0] Flash configuration for XIP and AUTO DMA operations.
                                                     Controls value for SER (Slave Enable) for XIP operations
                                                     and address generation for DMA/XIP modes. Also used to
                                                     configure SPIFRF (frame format).                                          */
      __IOM uint32_t ASIZE0     : 2;            /*!< [5..4] Address Size. Address bytes to send from ADDR register             */
      __IOM uint32_t ISIZE0     : 1;            /*!< [6..6] Instruction Size                                                   */
      __IOM uint32_t SEPIO0     : 1;            /*!< [7..7] Separate IO configuration. This bit should be set when
                                                     the target device has separate MOSI and MISO pins. Respective
                                                     IN/OUT bits below should be set to map pins.                              */
      __IOM uint32_t TURNAROUND0 : 6;           /*!< [13..8] Number of turnaound cycles (for TX->RX transitions).
                                                     Qualified by ENTURN bit field.                                            */
      __IOM uint32_t CPHA0      : 1;            /*!< [14..14] Serial clock phase.                                              */
      __IOM uint32_t CPOL0      : 1;            /*!< [15..15] Serial clock polarity.                                           */
      __IOM uint32_t CLKDIV0    : 6;            /*!< [21..16] Clock Divider. Allows dividing 96 MHz base clock by
                                                     integer multiples. Enumerations are provided for common
                                                     frequency, but any integer divide from 96 MHz is allowed.
                                                     Odd divide ratios will result in a 33/66 percent duty cycle
                                                     with a long low clock pulse (to allow longer round-trip
                                                     for read data).                                                           */
      __IOM uint32_t RXCAP0     : 1;            /*!< [22..22] Controls RX data capture phase. A setting of 0 (NORMAL)
                                                     captures read data at the normal capture point relative
                                                     to the internal clock launch point. However, to accomodate
                                                     chip/pad/board delays, a setting of RXCAP of 1 is expected
                                                     to be used to align the capture point with the return data
                                                     window. This bit is used in conjunction with RXNEG to provide
                                                     4 unique capture points, all about 10ns apart.                            */
      __IOM uint32_t RXNEG0     : 1;            /*!< [23..23] Adjusts the RX capture phase to the negedge of the
                                                     48MHz internal clock (~10ns early). For normal operation,
                                                     it is expected that RXNEG will be set to 0.                               */
      __IOM uint32_t TXNEG0     : 1;            /*!< [24..24] Launches TX data a half clock cycle (~10ns) early.
                                                     This should normally be programmed to zero (NORMAL).                      */
            uint32_t            : 1;
      __IOM uint32_t WRITELATENCY0 : 6;         /*!< [31..26] Number of write Latency cycles. Qualified by ENTURN
                                                     bit field.                                                                */
    } DEV0CFG_b;
  } ;

  union {
    __IOM uint32_t DEV0DDR;                     /*!< (@ 0x00000088) Timing configuration bits for DDR operation of
                                                                    the MSPI module.                                           */

    struct {
      __IOM uint32_t EMULATEDDR0 : 1;           /*!< [0..0] Drive external clock at 1/2 rate to emulate DDR mode               */
      __IOM uint32_t QUADDDR0   : 1;            /*!< [1..1] Enables use of delay line to provide fine control over
                                                     traditional RX capture clock.                                             */
      __IOM uint32_t ENABLEDQS0 : 1;            /*!< [2..2] In EMULATEDDR mode, enable DQS for read capture                    */
      __IOM uint32_t DQSSYNCNEG0 : 1;           /*!< [3..3] Use negative edge of clock for DDR data sync                       */
      __IOM uint32_t OVERRIDERXDQSDELAY0 : 1;   /*!< [4..4] Override DQS delay line with the value in DQSDELAY (for
                                                     RX capture in QUADDDR mode)                                               */
      __IOM uint32_t OVERRIDEDDRCLKOUTDELAY0 : 1;/*!< [5..5] Override TX delay line with the value in DQSDELAY (for
                                                     TX clock offset when in QUADDDR mode)                                     */
      __IOM uint32_t ENABLEFINEDELAY0 : 1;      /*!< [6..6] Enables use of delay line to provide fine control over
                                                     traditional RX capture clock.                                             */
            uint32_t            : 1;
      __IOM uint32_t RXDQSDELAY0 : 5;           /*!< [12..8] When OVERRIDEDQSDELAY is set this sets the DQS delay
                                                     line value. In ENABLEDQS mode, this acts as an offset to
                                                     the computed value (should be set to 0 by default)                        */
            uint32_t            : 3;
      __IOM uint32_t TXDQSDELAY0 : 5;           /*!< [20..16] When OVERRIDEDQSDELAY is set this sets the DQS delay
                                                     line value. In ENABLEDQS mode, this acts as an offset to
                                                     the computed value (should be set to 0 by default)                        */
            uint32_t            : 11;
    } DEV0DDR_b;
  } ;
  __IM  uint32_t  RESERVED4;

  union {
    __IOM uint32_t DEV0XIP;                     /*!< (@ 0x00000090) When any SPI flash is configured, this register
                                                                    must be properly programmed before XIP or
                                                                    AUTO DMA operations commence.                              */

