lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t WTULPIOM0  : 4;            /*!< [3..0] Weight used for ULP mode IOM0                                      */
      __IOM uint32_t WTULPIOM1  : 4;            /*!< [7..4] Weight used for ULP mode IOM1                                      */
      __IOM uint32_t WTULPIOM2  : 4;            /*!< [11..8] Weight used for ULP mode IOM2                                     */
      __IOM uint32_t WTULPIOM3  : 4;            /*!< [15..12] Weight used for ULP mode IOM3                                    */
      __IOM uint32_t WTULPIOM4  : 4;            /*!< [19..16] Weight used for ULP mode IOM4                                    */
      __IOM uint32_t WTULPIOM5  : 4;            /*!< [23..20] Weight used for ULP mode IOM5                                    */
      __IOM uint32_t WTULPIOM6  : 4;            /*!< [27..24] Weight used for ULP mode IOM6                                    */
      __IOM uint32_t WTULPIOM7  : 4;            /*!< [31..28] Weight used for ULP mode IOM7                                    */
    } PWRWEIGHTULP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP2;               /*!< (@ 0x00000148) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTULPADC   : 4;            /*!< [3..0] Weight used for ULP mode ADC                                       */
      __IOM uint32_t WTULPMSPI0 : 4;            /*!< [7..4] Weight used for ULP mode MSPI0                                     */
      __IOM uint32_t WTULPMSPI1 : 4;            /*!< [11..8] Weight used for ULP mode MSPI1                                    */
      __IOM uint32_t WTULPGFX   : 4;            /*!< [15..12] Weight used for ULP mode GFX                                     */
      __IOM uint32_t WTULPDISP  : 4;            /*!< [19..16] Weight used for ULP mode DISP                                    */
      __IOM uint32_t WTULPCRYPTO : 4;           /*!< [23..20] Weight used for ULP mode CRYPTO                                  */
      __IOM uint32_t WTULPSDIO  : 4;            /*!< [27..24] Weight used for ULP mode SDIO                                    */
      __IOM uint32_t WTULPUSB   : 4;            /*!< [31..28] Weight used for ULP mode USB                                     */
    } PWRWEIGHTULP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP3;               /*!< (@ 0x0000014C) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTULPDSPA  : 4;            /*!< [3..0] Weight used for ULP mode DSPA                                      */
      __IOM uint32_t WTULPDBG   : 4;            /*!< [7..4] Weight used for ULP mode DBG                                       */
      __IOM uint32_t WTULPAUDREC : 4;           /*!< [11..8] Weight used for ULP mode AUDREC                                   */
      __IOM uint32_t WTULPAUDPB : 4;            /*!< [15..12] Weight used for ULP mode AUDPB                                   */
      __IOM uint32_t WTULPAUDADC : 4;           /*!< [19..16] Weight used for ULP mode AUDADC                                  */
            uint32_t            : 8;
      __IOM uint32_t WTULPMSPI2 : 4;            /*!< [31..28] Weight used for ULP mode MSPI2                                   */
    } PWRWEIGHTULP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP4;               /*!< (@ 0x00000150) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTULPI2S0  : 4;            /*!< [3..0] Weight used for ULP mode I2S0                                      */
      __IOM uint32_t WTULPI2S1  : 4;            /*!< [7..4] Weight used for ULP mode I2S1                                      */
            uint32_t            : 8;
      __IOM uint32_t WTULPPDM0  : 4;            /*!< [19..16] Weight used for ULP mode PDM0                                    */
      __IOM uint32_t WTULPPDM1  : 4;            /*!< [23..20] Weight used for ULP mode PDM1                                    */
      __IOM uint32_t WTULPPDM2  : 4;            /*!< [27..24] Weight used for ULP mode PDM2                                    */
      __IOM uint32_t WTULPPDM3  : 4;            /*!< [31..28] Weight used for ULP mode PDM3                                    */
    } PWRWEIGHTULP4_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTULP5;               /*!< (@ 0x00000154) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

