lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t WTULPDISPPHY : 4;          /*!< [3..0] Weight used for ULP mode DISP PHY                                  */
      __IOM uint32_t WTULPUSBPHY : 4;           /*!< [7..4] Weight used for ULP mode USB PHY                                   */
            uint32_t            : 24;
    } PWRWEIGHTULP5_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP0;                /*!< (@ 0x00000158) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPMCU    : 4;            /*!< [3..0] Weight used for LP mode MCU                                        */
      __IOM uint32_t WTLPDSP0   : 4;            /*!< [7..4] Weight used for LP mode DSP0                                       */
      __IOM uint32_t WTLPDSP1   : 4;            /*!< [11..8] Weight used for LP mode DSP1                                      */
      __IOM uint32_t WTLPIOS    : 4;            /*!< [15..12] Weight used for LP mode IOS                                      */
      __IOM uint32_t WTLPUART0  : 4;            /*!< [19..16] Weight used for LP mode UART0                                    */
      __IOM uint32_t WTLPUART1  : 4;            /*!< [23..20] Weight used for LP mode UART1                                    */
      __IOM uint32_t WTLPUART2  : 4;            /*!< [27..24] Weight used for LP mode UART2                                    */
      __IOM uint32_t WTLPUART3  : 4;            /*!< [31..28] Weight used for LP mode UART3                                    */
    } PWRWEIGHTLP0_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP1;                /*!< (@ 0x0000015C) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPIOM0   : 4;            /*!< [3..0] Weight used for LP mode IOM0                                       */
      __IOM uint32_t WTLPIOM1   : 4;            /*!< [7..4] Weight used for LP mode IOM1                                       */
      __IOM uint32_t WTLPIOM2   : 4;            /*!< [11..8] Weight used for LP mode IOM2                                      */
      __IOM uint32_t WTLPIOM3   : 4;            /*!< [15..12] Weight used for LP mode IOM3                                     */
      __IOM uint32_t WTLPIOM4   : 4;            /*!< [19..16] Weight used for LP mode IOM4                                     */
      __IOM uint32_t WTLPIOM5   : 4;            /*!< [23..20] Weight used for LP mode IOM5                                     */
      __IOM uint32_t WTLPIOM6   : 4;            /*!< [27..24] Weight used for LP mode IOM6                                     */
      __IOM uint32_t WTLPIOM7   : 4;            /*!< [31..28] Weight used for LP mode IOM7                                     */
    } PWRWEIGHTLP1_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP2;                /*!< (@ 0x00000160) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPADC    : 4;            /*!< [3..0] Weight used for LP mode ADC                                        */
      __IOM uint32_t WTLPMSPI0  : 4;            /*!< [7..4] Weight used for LP mode MSPI0                                      */
      __IOM uint32_t WTLPMSPI1  : 4;            /*!< [11..8] Weight used for LP mode MSPI1                                     */
      __IOM uint32_t WTLPGFX    : 4;            /*!< [15..12] Weight used for LP mode GFX                                      */
      __IOM uint32_t WTLPDISP   : 4;            /*!< [19..16] Weight used for LP mode DISP                                     */
      __IOM uint32_t WTLPCRYPTO : 4;            /*!< [23..20] Weight used for LP mode CRYPTO                                   */
      __IOM uint32_t WTLPSDIO   : 4;            /*!< [27..24] Weight used for LP mode SDIO                                     */
      __IOM uint32_t WTLPUSB    : 4;            /*!< [31..28] Weight used for LP mode USB                                      */
    } PWRWEIGHTLP2_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP3;                /*!< (@ 0x00000164) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

    struct {
      __IOM uint32_t WTLPDSPA   : 4;            /*!< [3..0] Weight used for LP mode DSPA                                       */
      __IOM uint32_t WTLPDBG    : 4;            /*!< [7..4] Weight used for LP mode DBG                                        */
      __IOM uint32_t WTLPAUDREC : 4;            /*!< [11..8] Weight used for LP mode AUDREC                                    */
      __IOM uint32_t WTLPAUDPB  : 4;            /*!< [15..12] Weight used for LP mode AUDPB                                    */
      __IOM uint32_t WTLPAUDADC : 4;            /*!< [19..16] Weight used for LP mode AUDADC                                   */
            uint32_t            : 8;
      __IOM uint32_t WTLPMSPI2  : 4;            /*!< [31..28] Weight used for LP mode MSPI2                                    */
    } PWRWEIGHTLP3_b;
  } ;

  union {
    __IOM uint32_t PWRWEIGHTLP4;                /*!< (@ 0x00000168) Weights specified in this register are applied
                                                                    to each of the masters active requests.
                                                                    The aggregate of all the masters is compared
                                                                    against the allowed value to change the
                                                                    buck from active to inactive mode.                         */

