lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t CMDRESP0   : 32;           /*!< [31..0] R[] refers to a bit range within the response data as
                                                     transmitted on the SD Bus, REP[] refers to a bit range
                                                     within the Response register.                                             */
    } RESPONSE0_b;
  } ;

  union {
    __IOM uint32_t RESPONSE1;                   /*!< (@ 0x00000014) Response1                                                  */

    struct {
      __IOM uint32_t CMDRESP1   : 32;           /*!< [31..0] R[] refers to a bit range within the response data as
                                                     transmitted on the SD Bus, REP[] refers to a bit range
                                                     within the Response register.                                             */
    } RESPONSE1_b;
  } ;

  union {
    __IOM uint32_t RESPONSE2;                   /*!< (@ 0x00000018) Response2                                                  */

    struct {
      __IOM uint32_t CMDRESP2   : 32;           /*!< [31..0] R[] refers to a bit range within the response data as
                                                     transmitted on the SD Bus, REP[] refers to a bit range
                                                     within the Response register.                                             */
    } RESPONSE2_b;
  } ;

  union {
    __IOM uint32_t RESPONSE3;                   /*!< (@ 0x0000001C) Response3                                                  */

    struct {
      __IOM uint32_t CMDRESP3   : 32;           /*!< [31..0] R[] refers to a bit range within the response data as
                                                     transmitted on the SD Bus, REP[] refers to a bit range
                                                     within the Response register.                                             */
    } RESPONSE3_b;
  } ;

  union {
    __IOM uint32_t BUFFER;                      /*!< (@ 0x00000020) Buffer data port                                           */

    struct {
      __IOM uint32_t BUFFERDATA : 32;           /*!< [31..0] The Host Controller Buffer can be accessed through this
                                                     32-bit Data Port Register.                                                */
    } BUFFER_b;
  } ;

  union {
    __IOM uint32_t PRESENT;                     /*!< (@ 0x00000024) Present state                                              */

    struct {
      __IOM uint32_t CMDINHCMD  : 1;            /*!< [0..0] If this bit is 0, it indicates the CMD line is not in
                                                     use and the HC can issue a SD command using the CMD line.
                                                     This bit is set immediately after the Command register
                                                     (00Fh) is written. This bit is cleared when the command
                                                     response is received. Even if the Command Inhibit (DAT)
                                                     is set to 1, Commands using only the CMD line can be issued
                                                     if this bit is 0. Changing from 1 to 0 generates a Command
                                                     complete interrupt in the Normal Interrupt Status register.
                                                     If the HC cannot issue the command because of a comma                     */
      __IOM uint32_t CMDINHDAT  : 1;            /*!< [1..1] This status bit is generated if either the DAT Line Active
                                                     or the Read transfer Active is set to 1. If this bit is
                                                     0, it indicates the HC can issue the next SD command. Commands
                                                     with busy signal belong to Command Inhibit (DAT) (ex. R1b,
                                                     R5b type). Changing from 1 to 0 generates a Transfer Complete
                                                     interrupt in the Normal interrupt status register. Note:
                                                     The SD Host Driver can save registers in the range of 000-00Dh
                                                     for a suspend transaction after this bit has changed from
                                                     1 to 0.                                                                   */
      __IOM uint32_t DLINEACT   : 1;            /*!< [2..2] This bit indicates whether one of the DAT line on SD
                                                     bus is in use.                                                            */
      __IOM uint32_t RETUNINGREQUEST : 1;       /*!< [3..3] Re-Tuning Request Host Controller may request Host Driver
                                                     to execute re-tuning sequence by setting this bit when
                                                     the data window is shifted by temperature drift and a tuned
                                                     sampling point does not have a good margin to receive correct
                                                     data. This bit is cleared when a command is issued with
                                                     setting Execute Tuning in the Host Control 2 register.
                                                     Changing of this bit from 0 to 1 generates Re-Tuning Event.
                                                     Refer to Normal Interrupt registers for more detail. This
                                                     bit isn't set to 1 if Sampling Clock Select in                            */
            uint32_t            : 4;
      __IOM uint32_t WRXFERACT  : 1;            /*!< [8..8] This status indicates a write transfer is active. If
                                                     this bit is 0, it means no valid write data exists in the
                                                     HC. This bit is set in either of the following cases: After
                                                     the end bit of the write command. When writing a 1 to Continue
                                                     Request in the Block Gap Control register to restart a
                                                     write transfer. This bit is cleared in either of the following
                                                     cases: After getting the CRC status of the last data block
                                                     as specified by the transfer count (Single or Multiple)
                                                     After getting a CRC status of any block wher                              */
      __IOM uint32_t RDXFERACT  : 1;            /*!< [9..9] This status is used for detecting completion of a read
                                                     transfer. This bit is set to 1 for either of the following
                                                     conditions: After the end bit of the read command When
                                                     writing a 1 to continue Request in the Block Gap Control
                                                     register to restart a read transfer This bit is cleared
                                                     to 0 for either of the following conditions: When the last
                                                     data block as specified by block length is transferred
                                                     to the system. When all valid data blocks have been transferred
                                                     to the system and no current block transfers are be                       */
      __IOM uint32_t BUFWREN    : 1;            /*!< [10..10] This status is used for non-DMA write transfers. This
                                                     read only flag indicates if space is available for write
                                                     data. If this bit is 1, data can be written to the buffer.
                                                     A change of this bit from 1 to 0 occurs when all the block
                                                     data is written to the buffer. A change of this bit from
                                                     0 to 1 occurs when top of block data can be written to
                                                     the buffer and generates the Buffer Write Ready Interrupt.                */
      __IOM uint32_t BUFRDEN    : 1;            /*!< [11..11] This status is used for non-DMA read transfers. This
                                                     read only flag indicates that valid data exists in the
                                                     host side buffer status. If this bit is 1, readable data
                                                     exists in the buffer. A change of this bit from 1 to 0
                                                     occurs when all the block data is read from the buffer.
                                                     A change of this bit from 0 to 1 occurs when all the block
                                                     data is ready in the buffer and generates the Buffer Read
                                                     Ready Interrupt.                                                          */
            uint32_t            : 4;
      __IOM uint32_t CARDINSERTED : 1;          /*!< [16..16] This bit indicates whether a card has been inserted.
                                                     Changing from 0 to 1 generates a Card Insertion interrupt
                                                     in the Normal Interrupt Status register and changing from
                                                     1 to 0 generates a Card Removal Interrupt in the Normal
                                                     Interrupt Status register. The Software Reset For All in
                                                     the Software Reset register shall not affect this bit.
                                                     If a Card is removed while its power is on and its clock
                                                     is oscillating, the HC shall clear SD Bus Power in the
                                                     Power Control register and SD Clock Enable in the Clock
                                                     contro                                                                    */
      __IOM uint32_t CARDSTABLE : 1;            /*!< [17..17] This bit is used for testing. If it is 0, the Card
                                                     Detect Pin Level is not stable. If this bit is set to 1,
                                                     it means the Card Detect Pin Level is stable. The Software
                                                     Reset For All in the Software Reset Register shall not
                                                     affect this bit.                                                          */
      __IOM uint32_t CARDDET    : 1;            /*!< [18..18] This bit reflects the inverse value of the SDCD# pin.            */
      __IOM uint32_t WRPROTSW   : 1;            /*!< [19..19] The Write Protect Switch is supported for memory and
                                                     combo cards. This bit reflects the SDWP# pin.                             */
      __IOM uint32_t DAT30LINE  : 4;            /*!< [23..20] This status is used to check DAT line level to recover
                                                     from errors, and for debugging. This is especially useful
                                                     in detecting the busy signal level from DAT[0].                           */
      __IOM uint32_t CMDLINE    : 1;            /*!< [24..24] This status is used to check CMD line level to recover
                                                     from errors, and for debugging.                                           */
      __IOM uint32_t DAT74LINE  : 4;            /*!< [28..25] This status is used to check DAT line level to recover
                                                     from errors, and for debugging.                                           */
            uint32_t            : 3;
    } PRESENT_b;
  } ;

  union {
    __IOM uint32_t HOSTCTRL1;                   /*!< (@ 0x00000028) Host control 1                                             */

