lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< [5..0] Pad output 112 configuration                                       */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< [13..8] Pad output 113 configuration                                      */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< [21..16] Pad output 114 configuration                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< [29..24] Pad output 115 configuration                                     */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< (@ 0x000000F4) Pad output configuration 0.                                */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< [5..0] Pad output 116 configuration                                       */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< [13..8] Pad output 117 configuration                                      */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< [21..16] Pad output 118 configuration                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< [29..24] Pad output 119 configuration                                     */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;

  union {
    __IOM uint32_t OUTCFG30;                    /*!< (@ 0x000000F8) Pad output configuration 0.                                */

    struct {
      __IOM uint32_t OUTCFG120  : 6;            /*!< [5..0] Pad output 120 configuration                                       */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG121  : 6;            /*!< [13..8] Pad output 121 configuration                                      */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG122  : 6;            /*!< [21..16] Pad output 122 configuration                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG123  : 6;            /*!< [29..24] Pad output 123 configuration                                     */
            uint32_t            : 2;
    } OUTCFG30_b;
  } ;

  union {
    __IOM uint32_t OUTCFG31;                    /*!< (@ 0x000000FC) Pad output configuration 0.                                */

    struct {
      __IOM uint32_t OUTCFG124  : 6;            /*!< [5..0] Pad output 124 configuration                                       */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG125  : 6;            /*!< [13..8] Pad output 125 configuration                                      */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG126  : 6;            /*!< [21..16] Pad output 126 configuration                                     */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG127  : 6;            /*!< [29..24] Pad output 127 configuration                                     */
            uint32_t            : 2;
    } OUTCFG31_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t AUXEN;                       /*!< (@ 0x00000104) Pattern Address                                            */

    struct {
      __IOM uint32_t TMR00EN    : 1;            /*!< [0..0] Rev B1 TIMER00 auxiliary enable.                                   */
      __IOM uint32_t TMR01EN    : 1;            /*!< [1..1] Rev B1 TIMER01 auxiliary enable.                                   */
      __IOM uint32_t TMR02EN    : 1;            /*!< [2..2] Rev B1 TIMER02 auxiliary enable.                                   */
      __IOM uint32_t TMR03EN    : 1;            /*!< [3..3] Rev B1 TIMER03 auxiliary enable.                                   */
      __IOM uint32_t TMR04EN    : 1;            /*!< [4..4] Rev B1 TIMER04 auxiliary enable.                                   */
      __IOM uint32_t TMR05EN    : 1;            /*!< [5..5] Rev B1 TIMER05 auxiliary enable.                                   */
      __IOM uint32_t TMR06EN    : 1;            /*!< [6..6] Rev B1 TIMER06 auxiliary enable.                                   */
      __IOM uint32_t TMR07EN    : 1;            /*!< [7..7] Rev B1 TIMER07 auxiliary enable.                                   */
      __IOM uint32_t TMR08EN    : 1;            /*!< [8..8] Rev B1 TIMER08 auxiliary enable.                                   */
      __IOM uint32_t TMR09EN    : 1;            /*!< [9..9] Rev B1 TIMER09 auxiliary enable.                                   */
      __IOM uint32_t TMR10EN    : 1;            /*!< [10..10] Rev B1 TIMER10 auxiliary enable.                                 */
      __IOM uint32_t TMR11EN    : 1;            /*!< [11..11] Rev B1 TIMER11 auxiliary enable.                                 */
      __IOM uint32_t TMR12EN    : 1;            /*!< [12..12] Rev B1 TIMER12 auxiliary enable.                                 */
      __IOM uint32_t TMR13EN    : 1;            /*!< [13..13] Rev B1 TIMER13 auxiliary enable.                                 */
      __IOM uint32_t TMR14EN    : 1;            /*!< [14..14] Rev B1 TIMER14 auxiliary enable.                                 */
      __IOM uint32_t TMR15EN    : 1;            /*!< [15..15] Rev B1 TIMER15 auxiliary enable.                                 */
      __IOM uint32_t STMREN     : 1;            /*!< [16..16] Rev B1 STIMER auxiliary enable.                                  */
            uint32_t            : 15;
    } AUXEN_b;
  } ;
  __IM  uint32_t  RESERVED4[62];

  union {
    __IOM uint32_t CTRL0;                       /*!< (@ 0x00000200) This includes the Control bit fields for timer
                                                                    0.                                                         */

