lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t CTS        : 1;            /*!< [0..0] Clear to send. This bit is the complement of the UART
                                                     clear to send, nUARTCTS, modem status input. That is, the
                                                     bit is 1 when nUARTCTS is LOW.                                            */
      __IOM uint32_t DSR        : 1;            /*!< [1..1] Data set ready. This bit is the complement of the UART
                                                     data set ready, nUARTDSR, modem status input. That is,
                                                     the bit is 1 when nUARTDSR is LOW.                                        */
      __IOM uint32_t DCD        : 1;            /*!< [2..2] Data carrier detect. This bit is the complement of the
                                                     UART data carrier detect, nUARTDCD, modem status input.
                                                     That is, the bit is 1 when nUARTDCD is LOW.                               */
      __IOM uint32_t BUSY       : 1;            /*!< [3..3] UART busy. If this bit is set to 1, the UART is busy
                                                     transmitting data. This bit remains set until the complete
                                                     byte, including all the stop bits, has been sent from the
                                                     shift register. This bit is set as soon as the transmit
                                                     FIFO becomes non-empty, regardless of whether the UART
                                                     is enabled or not.                                                        */
      __IOM uint32_t RXFE       : 1;            /*!< [4..4] Receive FIFO empty. The meaning of this bit depends on
                                                     the state of the FEN bit in the UARTLCRH Register. If the
                                                     FIFO is disabled, this bit is set when the receive holding
                                                     register is empty. If the FIFO is enabled, the RXFE bit
                                                     is set when the receive FIFO is empty.                                    */
      __IOM uint32_t TXFF       : 1;            /*!< [5..5] Transmit FIFO full. The meaning of this bit depends on
                                                     the state of the FEN bit in the UARTLCRH Register. If the
                                                     FIFO is disabled, this bit is set when the transmit holding
                                                     register is full. If the FIFO is enabled, the TXFF bit
                                                     is set when the transmit FIFO is full.                                    */
      __IOM uint32_t RXFF       : 1;            /*!< [6..6] Receive FIFO full. The meaning of this bit depends on
                                                     the state of the FEN bit in the UARTLCRH Register. If the
                                                     FIFO is disabled, this bit is set when the receive holding
                                                     register is full. If the FIFO is enabled, the RXFF bit
                                                     is set when the receive FIFO is full.                                     */
      __IOM uint32_t TXFE       : 1;            /*!< [7..7] Transmit FIFO empty. The meaning of this bit depends
                                                     on the state of the FEN bit in the Line Control Register,
                                                     UARTLCRH. If the FIFO is disabled, this bit is set when
                                                     the transmit holding register is empty. If the FIFO is
                                                     enabled, the TXFE bit is set when the transmit FIFO is
                                                     empty. This bit does not indicate if there is data in the
                                                     transmit shift register.                                                  */
      __IOM uint32_t TXBUSY     : 1;            /*!< [8..8] This bit holds the transmit BUSY indicator.                        */
            uint32_t            : 23;
    } FR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ILPR;                        /*!< (@ 0x00000020) IrDA Counter                                               */

    struct {
      __IOM uint32_t ILPDVSR    : 8;            /*!< [7..0] 8-bit low-power divisor value. These bits are cleared
                                                     to 0 at reset. Programming a zero value results in no IrLPBaud16
                                                     pulses being generated.                                                   */
            uint32_t            : 24;
    } ILPR_b;
  } ;

  union {
    __IOM uint32_t IBRD;                        /*!< (@ 0x00000024) Integer Baud Rate Divisor                                  */

    struct {
      __IOM uint32_t DIVINT     : 16;           /*!< [15..0] These bits hold the baud integer divisor. These bits
                                                     are cleared to 0 on reset.                                                */
            uint32_t            : 16;
    } IBRD_b;
  } ;

  union {
    __IOM uint32_t FBRD;                        /*!< (@ 0x00000028) Fractional Baud Rate Divisor                               */

    struct {
      __IOM uint32_t DIVFRAC    : 6;            /*!< [5..0] These bits hold the baud fractional divisor. These bits
                                                     are cleared to 0 on reset.                                                */
            uint32_t            : 26;
    } FBRD_b;
  } ;

  union {
    __IOM uint32_t LCRH;                        /*!< (@ 0x0000002C) Line Control High                                          */

