lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t BF70       : 8;            /*!< [7..0] This bitfield is reserved.                                         */
            uint32_t            : 24;
    } REG84_b;
  } ;
} USBPHY_Type;                                  /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB device register descriptions. (USB)
  */

typedef struct {                                /*!< (@ 0x400B0000) USB Structure                                              */

  union {
    __IOM uint32_t CFG0;                        /*!< (@ 0x00000000) Function address, power management, interrupt
                                                                    status register for EP0 and IN Endpoints
                                                                    1 to 5                                                     */

    struct {
      __IOM uint32_t FuncAddr   : 7;            /*!< [6..0] The function address. This field should be written with
                                                     the address value contained in the SET_ADDRESS standard
                                                     device request, when it is received on Endpoint 0. The
                                                     new address will not take effect immediately as the host
                                                     will still be using the old address for the Status stage
                                                     of the device request. The USB Controller will continue
                                                     to use the old address for decoding packets until the device
                                                     request has completed. The status of the device request
                                                     can be determined by reading the Update bit. When a new
                                                     a                                                                         */
      __IOM uint32_t Update     : 1;            /*!< [7..7] Function Address Update. Set when FuncAddr is written.
                                                     Cleared when the new address takes effect (at the end of
                                                     the current transfer).                                                    */
      __IOM uint32_t Enabl      : 1;            /*!< [8..8] Set by the CPU to enable the SUSPENDM signal. The Enabl
                                                     bit is set to enable the SUSPENDM signal to put the UTM
                                                     (and any other hardware which uses the SUSPENDM signal)
                                                     into Suspend mode. If this bit is not set, Suspend mode
                                                     will be detected as normal but the SUSPENDM signal will
                                                     remain high so that the UTM does not go into its low-power
                                                     mode.                                                                     */
      __IOM uint32_t Suspen     : 1;            /*!< [9..9] Suspend Status. This read-only bit is set when Suspend
                                                     mode is entered. It is cleared when the CPU reads the interrupt
                                                     register, or sets the Resume bit of this register. The
                                                     Suspen bit is set by the USB Controller when Suspend mode
                                                     is entered. It will be cleared when the CFG2_Suspend field
                                                     is read (as a result of receiving a Suspend interrupt).
                                                     It will also be cleared if Suspend mode is left by setting
                                                     the Resume bit to initiate a remote wake-up.                              */
      __IOM uint32_t Resume     : 1;            /*!< [10..10] Resume. Set should clear this bit after 10 ms (a maximum
                                                     of 15 ms) to end Resume signaling. The Resume bit is used
                                                     to force the USB Controller to generate Resume signaling
                                                     on the USB to perform remote wake-up from Suspend mode.
                                                     Once set high, it should be left high for approximately
                                                     10 ms (at least 1 ms and no more than 15 ms), then cleared.               */
      __IOM uint32_t Reset      : 1;            /*!< [11..11] Reset Status. Cleared when either HS negotiation has
                                                     completed successfully or after 2.1 ms of reset signaling
                                                     if HS negotiation fails. The Reset bit can be used to determine
                                                     when reset signaling is present on the USB. Set when Reset
                                                     signaling is detected and remains high until the bus reverts
                                                     to an idle state.                                                         */
      __IOM uint32_t HSMode     : 1;            /*!< [12..12] This read-only bit is set when the USB Controller has
                                                     successfully negotiated for High-speed mode. The HSMode
                                                     bit can be used to determine whether the USB Controller
                                                     is in High-speed mode or Full-speed mode. It will go high
                                                     when the function has successfully negotiated for high-speed
                                                     operation during a USB reset.                                             */
      __IOM uint32_t HSEnab     : 1;            /*!< [13..13] High-speed Enable. When set by the CPU, the USB Controller
                                                     will negotiate for high-speed mode when the device is reset
                                                     by the hub. If not set, the device will only operate in
                                                     Full-speed mode. The HSEnab bit can be used to disable
                                                     high-speed operation. Normally the USB Controller will
                                                     automatically negotiate for high speed operation, when
                                                     it is reset, by sending a 'chirp' to the hub. However if
                                                     this bit is cleared then the USB Controller will not send
                                                     any 'chirps' to the hub so the function will remain in
                                                     F                                                                         */
      __IOM uint32_t AMSPECIFIC : 1;            /*!< [14..14] Software-enabled Connection (SoftConn). When set to
                                                     1, the PHY is placed in its normal mode and the D+/D- lines
                                                     of the USB bus are enabled. When bit is cleared, the PHY
                                                     is put into non-driving mode and D+ and D- are tri-stated.                */
      __IOM uint32_t ISOUpdate  : 1;            /*!< [15..15] Isochronous Transfer Update. When set by the CPU, the
                                                     USB Controller will wait for an SOF token from the time
                                                     InPktRdy is set before sending the packet. If an IN token
                                                     is received before an SOF token, then a zero length data
                                                     packet will be sent. Note: This bit only affects endpoints
                                                     performing Isochronous transfers. The ISOUpdate bit affects
                                                     all IN Isochronous endpoints in the USB Controller. It
                                                     is normally used as a method of ensuring 'clean' start-up
                                                     of an IN Isochronous pipe.                                                */
      __IOM uint32_t EP0InIntStat : 1;          /*!< [16..16] IN Endpoint 0 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP1InIntStat : 1;          /*!< [17..17] IN Endpoint 1 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP2InIntStat : 1;          /*!< [18..18] IN Endpoint 2 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP3InIntStat : 1;          /*!< [19..19] IN Endpoint 3 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP4InIntStat : 1;          /*!< [20..20] IN Endpoint 4 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
      __IOM uint32_t EP5InIntStat : 1;          /*!< [21..21] IN Endpoint 5 interrupt status. All interrupts are
                                                     cleared when the register is read.                                        */
            uint32_t            : 10;
    } CFG0_b;
  } ;

  union {
    __IOM uint32_t CFG1;                        /*!< (@ 0x00000004) Indicates which of the IN Endpoint 1 - 5 interrupts
                                                                    and the single Endpoint 0 interrupt are
                                                                    currently active. Also indicates which of
                                                                    the interrupts for OUT Endpoint 1 - 5 are
                                                                    currently active. All active interrupts
                                                                    are cleared when this register is read.                    */

