lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t ENDPTOUTCOUNT : 13;        /*!< [12..0] Endpoint OUT Count. When CFG3_ENDPOINT = 1 to 5, this
                                                     read-only field holds the number of received data bytes
                                                     in the packet in the Endpoint's OUT FIFO. When CFG3_ENDPOINT
                                                     = 0, this read-only field holds 7-bit data for number of
                                                     received data bytes in Endpoint 0 FIFO (OUT count). In
                                                     either case, the value returned changes as the contents
                                                     of the FIFO change and is only valid while OutPktRdy is
                                                     set. (IMPORTANT: The address for the OUTCOUNT register
                                                     is actually the same as COUNT0. However to avoid CMSIS
                                                     confli                                                                    */
            uint32_t            : 3;
      __IOM uint32_t INFIFOSZ   : 5;            /*!< [20..16] IN FIFO Size. Sets the size of the selected IN endpoint
                                                     FIFO. Bit 4 of this field defines whether double-packet
                                                     buffering supported. When set, double-packet buffering
                                                     is supported. When cleared, only single-packet buffering
                                                     is supported. Bits [3:0] of this field determine maximum
                                                     packet size, where 2^^(b3:b0 + 3) is the maximum packet
                                                     size to be allowed (before any splitting within the FIFO
                                                     of Bulk/High-Bandwidth packets prior to transmission).                    */
            uint32_t            : 3;
      __IOM uint32_t OUTFIFOSZ  : 5;            /*!< [28..24] OUT FIFO Size. Sets the size of the selected OUT endpoint
                                                     FIFO. Bit 4 of this field defines whether double-packet
                                                     buffering is supported. When set, double-packet buffering
                                                     is supported. When cleared, only single-packet buffering
                                                     is supported. Bits [3:0] of this field determine maximum
                                                     packet size, where 2^^(b3:b0 + 3) is the maximum packet
                                                     size to be allowed (before any splitting within the FIFO
                                                     of Bulk/High-Bandwidth packets prior to transmission).                    */
            uint32_t            : 3;
    } IDX2_b;
  } ;

  union {
    __IOM uint32_t FIFOADD;                     /*!< (@ 0x0000001C) Sets the start address of the selected IN and
                                                                    OUT endpoint FIFOs.                                        */

    struct {
      __IOM uint32_t INFIFOADD  : 13;           /*!< [12..0] Sets the start address of the selected IN endpoint FIFO.          */
            uint32_t            : 3;
      __IOM uint32_t OUTFIFOADD : 13;           /*!< [28..16] Sets the start address of the selected OUT endpoint
                                                     FIFO.                                                                     */
            uint32_t            : 3;
    } FIFOADD_b;
  } ;

  union {
    __IOM uint32_t FIFO0;                       /*!< (@ 0x00000020) Endpoint 0 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 0.                                                      */
    } FIFO0_b;
  } ;

  union {
    __IOM uint32_t FIFO1;                       /*!< (@ 0x00000024) Endpoint 1 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 1.                                                      */
    } FIFO1_b;
  } ;

  union {
    __IOM uint32_t FIFO2;                       /*!< (@ 0x00000028) Endpoint 2 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 2.                                                      */
    } FIFO2_b;
  } ;

  union {
    __IOM uint32_t FIFO3;                       /*!< (@ 0x0000002C) Endpoint 3 FIFO register                                   */

    struct {
      __IOM uint32_t FIFO       : 32;           /*!< [31..0] Writing to this register loads data into the IN FIFO
                                                     and reading from this register unloads data from the OUT
                                                     FIFO for endpoint 3.                                                      */
    } FIFO3_b;
  } ;

  union {
    __IOM uint32_t FIFO4;                       /*!< (@ 0x00000030) Endpoint 4 FIFO register                                   */

