lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t PHYREFCLKDIS : 1;          /*!< [0..0] Setting this bit turns off the PHY reference clock.                */
            uint32_t            : 7;
      __IOM uint32_t CTRLAPBCLKDIS : 1;         /*!< [8..8] Setting this bit turns off the Controller logic clock.             */
            uint32_t            : 7;
      __IOM uint32_t PHYAPBLCLKDIS : 1;         /*!< [16..16] Setting this bit turns off PHY control logic clock.              */
            uint32_t            : 7;
      __IOM uint32_t PHYREFCLKSEL : 2;          /*!< [25..24] USB PHY reference clock select.For Full_Speed Mode,
                                                     set the reference CLKSEL to use HFRC-based clock. For High-Speed
                                                     Mode, set the reference CLKSEL to use HFRC2-based clock.
                                                     The HFRC2-based clock is higher power, but meets the low-jitter
                                                     requirement for High-Speed Mode.                                          */
            uint32_t            : 6;
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< (@ 0x00002004) Provides optional SRAM tuning control.                     */

    struct {
      __IOM uint32_t RET1N      : 1;            /*!< [0..0] Retention mode 1 enable, active-LOW                                */
      __IOM uint32_t EMA        : 3;            /*!< [3..1] Extra margin adjustment                                            */
      __IOM uint32_t EMAS       : 1;            /*!< [4..4] Extra margin adjustment sense amplifier pulse                      */
      __IOM uint32_t EMAW       : 2;            /*!< [6..5] Extra margin adjustment for write operations                       */
      __IOM uint32_t RAWLM      : 2;            /*!< [8..7] SRAM Adjustment for margin for this read assist scheme             */
      __IOM uint32_t RAWL       : 1;            /*!< [9..9] SRAM Read assist enable                                            */
      __IOM uint32_t WABLM      : 3;            /*!< [12..10] SRAM No margin adjustment                                        */
      __IOM uint32_t WABL       : 1;            /*!< [13..13] SRAM write assist enable                                         */
      __IOM uint32_t STOV       : 1;            /*!< [14..14] SRAM self-timed override                                         */
            uint32_t            : 17;
    } SRAMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[3];

  union {
    __IOM uint32_t UTMISTICKYSTATUS;            /*!< (@ 0x00002014) This read only register provides the results
                                                                    from the PHY OBS port controlled by reg
                                                                    0x20[5:4]. IF any bits are set, the bits
                                                                    are sticky. Clear this register using the
                                                                    OBSCLRSTAT register.                                       */

    struct {
      __IOM uint32_t obsportstciky : 2;         /*!< [1..0] These bits are read only status bits from the PHY OBS
                                                     port                                                                      */
            uint32_t            : 30;
    } UTMISTICKYSTATUS_b;
  } ;

  union {
    __IOM uint32_t OBSCLRSTAT;                  /*!< (@ 0x00002018) Clears all bits in the sticky obs status register.         */

    struct {
      __IOM uint32_t CLRSTAT    : 1;            /*!< [0..0] Writing a 1 to this bit clears all bits in the UTMISTICKYSTATUS
                                                     register.                                                                 */
            uint32_t            : 31;
    } OBSCLRSTAT_b;
  } ;

  union {
    __IOM uint32_t DPDMPULLDOWN;                /*!< (@ 0x0000201C) Enables a pulldown resistor(15K) on D+ or D-               */

    struct {
      __IOM uint32_t DMPULLDOWN : 1;            /*!< [0..0] Enables a pulldown resistor(15K) on D-                             */
      __IOM uint32_t DPPULLDOWN : 1;            /*!< [1..1] Enables a pulldown resistor(15K) on D+                             */
            uint32_t            : 30;
    } DPDMPULLDOWN_b;
  } ;

  union {
    __IOM uint32_t BCDETSTATUS;                 /*!< (@ 0x00002020) USB Battery Charge Detenction Registers                    */

    struct {
      __IOM uint32_t DPATTACHED : 1;            /*!< [0..0] Data pin attachment detected                                       */
      __IOM uint32_t CPDETECTED : 1;            /*!< [1..1] Charging port detected                                             */
      __IOM uint32_t DCPDETECTED : 1;           /*!< [2..2] Dedicated charging port detected                                   */
            uint32_t            : 1;
      __IOM uint32_t DPCOMPOUT  : 1;            /*!< [4..4] DP comparator output                                               */
      __IOM uint32_t DMCOMPOUT  : 1;            /*!< [5..5] DM comparator output                                               */
            uint32_t            : 26;
    } BCDETSTATUS_b;
  } ;

  union {
    __IOM uint32_t BCDETCRTL1;                  /*!< (@ 0x00002024) Battery Charging detection main control register           */

    struct {
      __IOM uint32_t BCWEAKPULLUPEN : 1;        /*!< [0..0] Enables weak source current to DP and DM                           */
      __IOM uint32_t BCWEAKPULLDOWNEN : 1;      /*!< [1..1] Enables weak sink current on DP and DM                             */
      __IOM uint32_t IDMSINKEN  : 1;            /*!< [2..2] Enables DM current sink                                            */
      __IOM uint32_t IDPSRCEN   : 1;            /*!< [3..3] Enables DP current source                                          */
      __IOM uint32_t VDPSRCEN   : 1;            /*!< [4..4] Enables DP voltage source                                          */
      __IOM uint32_t RDMPDWNEN  : 1;            /*!< [5..5] Enables DM BC 1.2 pull-down resistor                               */
      __IOM uint32_t VDMSRCEN   : 1;            /*!< [6..6] Enables DM voltage source                                          */
      __IOM uint32_t IDPSINKEN  : 1;            /*!< [7..7] Enables DP current sink                                            */
      __IOM uint32_t USBDCOMPREF : 2;           /*!< [9..8] Sets DP/DM vendor-specific comparator ref voltage                  */
            uint32_t            : 1;
      __IOM uint32_t USBDCOMPEN : 1;            /*!< [11..11] Enables DP/DM vendor-specific detection comparator               */
            uint32_t            : 19;
      __IOM uint32_t USBSWRESET : 1;            /*!< [31..31] Holds a USB controller and PHY in the reset for BC
                                                     detection                                                                 */
    } BCDETCRTL1_b;
  } ;

  union {
    __IOM uint32_t BCDETCRTL2;                  /*!< (@ 0x00002028) Battery Charging auxillary detection control
                                                                    register                                                   */

