lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t RSTRT      : 8;            /*!< [7..0] Writing 0xB2 to WDTRSTRT restarts the watchdog timer.
                                                     This is a write only register. Reading this register will
                                                     only provide all 0.                                                       */
            uint32_t            : 24;
    } RSTRT_b;
  } ;

  union {
    __IOM uint32_t LOCK;                        /*!< (@ 0x00000008) This register locks the watch dog timer. Once
                                                                    it is locked, the configuration register
                                                                    (WDTCFG) for watch dog timer cannot be written
                                                                    to.                                                        */

    struct {
      __IOM uint32_t LOCK       : 8;            /*!< [7..0] Writing 0x3A locks the watchdog timer. Once locked, the
                                                     WDTCFG reg cannot be written and WDTEN is set.                            */
            uint32_t            : 24;
    } LOCK_b;
  } ;

  union {
    __IOM uint32_t COUNT;                       /*!< (@ 0x0000000C) This register holds the current count for the
                                                                    watch dog timer. This is a read only register.
                                                                    SW cannot set the value in the counter,
                                                                    but can reset it.                                          */

    struct {
      __IOM uint32_t COUNT      : 8;            /*!< [7..0] Read-Only current value of the WDT counter                         */
            uint32_t            : 24;
    } COUNT_b;
  } ;

  union {
    __IOM uint32_t DSP0CFG;                     /*!< (@ 0x00000010) This is the configuration register for the DSP0
                                                                    watch dog timer. It controls the enable,
                                                                    interrupt set, clocks for the timer, the
                                                                    compare values for the counters to trigger
                                                                    a reset or interrupt. This register can
                                                                    only be written to if the associated DSP0TLOCK
                                                                    is not set.                                                */

    struct {
      __IOM uint32_t DSP0WDTEN  : 1;            /*!< [0..0] This bitfield enables the WDT. Setting the lock implicitly
                                                     sets the WTDEN bit as well.                                               */
      __IOM uint32_t DSP0INTEN  : 1;            /*!< [1..1] This bitfield enables the DSP0 WDT interrupt. Note :
                                                     This bit must be set before the interrupt status bit will
                                                     reflect a watchdog timer expiration. The IER interrupt
                                                     register must also be enabled for a WDT interrupt to be
                                                     sent to the NVIC.                                                         */
      __IOM uint32_t DSP0RESEN  : 1;            /*!< [2..2] This bitfield enables the DSP0 reset.                              */
      __IOM uint32_t DSP0PMRESEN : 1;           /*!< [3..3] This bitfield enables the DSP0 Power Controller (PM)
                                                     reset. This needs to be set together with the DSP0WDTEN
                                                     bit to allow the reset to trigger.                                        */
            uint32_t            : 4;
      __IOM uint32_t DSP0RESVAL : 8;            /*!< [15..8] This bitfield is the compare value for counter bits
                                                     7:0 to generate a watchdog reset for the DSP logic. This
                                                     will cause a software reset to the DSP core if the RESEN
                                                     bit is set and optionally interrupt the CPU.                              */
      __IOM uint32_t DSP0INTVAL : 8;            /*!< [23..16] This bitfield is the compare value for counter bits
                                                     7:0 to generate a watchdog interrupt.                                     */
      __IOM uint32_t DSP0PMRESVAL : 8;          /*!< [31..24] This bitfield is the compare value for counter bits
                                                     7:0 to generate a watchdog reset. This will cause a software
                                                     reset to the DSP Power Management logic if the PMRESEN
                                                     bit is set and optionally interrupt the CPU.                              */
    } DSP0CFG_b;
  } ;

  union {
    __IOM uint32_t DSP0RSTRT;                   /*!< (@ 0x00000014) This register will restart the watchdog timer.
                                                                    Writing a special key value into this register
                                                                    will result in the watch dog timer being
                                                                    reset, so that the count will start again.
                                                                    It is expected that the software will periodically
                                                                    write to this register to indicate that
                                                                    the system is functional. The watch dog
                                                                    timer can continue running when the system
                                                                    is in deep sleep, and the interrupt will
                                                                    trigger the wake. After the wake, the core
                                                                    can reset the watch dog timer.                             */

