lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
    struct {
      __IOM uint32_t DSP1RSTART : 8;            /*!< [7..0] Writing 0xd2 to DSP1RSTRT restarts the watchdog timer.
                                                     This is a write only register. Reading this register will
                                                     return 0.                                                                 */
            uint32_t            : 24;
    } DSP1RSTRT_b;
  } ;

  union {
    __IOM uint32_t DSP1TLOCK;                   /*!< (@ 0x00000028) This register locks the watch dog timer. Once
                                                                    it is locked, the configuration register
                                                                    (DSP1CFG) for watch dog timer cannot be
                                                                    written to and the timer is automatically
                                                                    enabled (WDTEN is set).                                    */

    struct {
      __IOM uint32_t DSP1LOCK   : 8;            /*!< [7..0] Writing 0x4e locks the watchdog timer. Once locked, the
                                                     WDTCFG reg cannot be written and WDTEN is set.                            */
            uint32_t            : 24;
    } DSP1TLOCK_b;
  } ;

  union {
    __IOM uint32_t DSP1COUNT;                   /*!< (@ 0x0000002C) This register holds the current count for the
                                                                    watch dog timer. This is a read only register.
                                                                    SW cannot set the value in the counter,
                                                                    but can reset it.                                          */

    struct {
      __IOM uint32_t DSP1COUNT  : 8;            /*!< [7..0] Read-Only current value of the WDT counter                         */
            uint32_t            : 24;
    } DSP1COUNT_b;
  } ;
  __IM  uint32_t  RESERVED[116];

  union {
    __IOM uint32_t WDTIEREN;                    /*!< (@ 0x00000200) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
      __IOM uint32_t DSPRESETINT : 1;           /*!< [1..1] Indicates that one of the DSP timers has issued a reset
                                                     or pmreset to the DSP core. This is used to interrupt the
                                                     main CPU.                                                                 */
            uint32_t            : 30;
    } WDTIEREN_b;
  } ;

  union {
    __IOM uint32_t WDTIERSTAT;                  /*!< (@ 0x00000204) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
      __IOM uint32_t DSPRESETINT : 1;           /*!< [1..1] Indicates that one of the DSP timers has issued a reset
                                                     or pmreset to the DSP core. This is used to interrupt the
                                                     main CPU.                                                                 */
            uint32_t            : 30;
    } WDTIERSTAT_b;
  } ;

  union {
    __IOM uint32_t WDTIERCLR;                   /*!< (@ 0x00000208) Write a 1 to a bit in this register to clear
                                                                    the interrupt status associated with that
                                                                    bit.                                                       */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
      __IOM uint32_t DSPRESETINT : 1;           /*!< [1..1] Indicates that one of the DSP timers has issued a reset
                                                     or pmreset to the DSP core. This is used to interrupt the
                                                     main CPU.                                                                 */
            uint32_t            : 30;
    } WDTIERCLR_b;
  } ;

  union {
    __IOM uint32_t WDTIERSET;                   /*!< (@ 0x0000020C) Write a 1 to a bit in this register to instantly
                                                                    generate an interrupt from this module.
                                                                    (Generally used for testing purposes).                     */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< [0..0] Watchdog Timer Interrupt.                                          */
      __IOM uint32_t DSPRESETINT : 1;           /*!< [1..1] Indicates that one of the DSP timers has issued a reset
                                                     or pmreset to the DSP core. This is used to interrupt the
                                                     main CPU.                                                                 */
            uint32_t            : 30;
    } WDTIERSET_b;
  } ;

  union {
    __IOM uint32_t DSP0IEREN;                   /*!< (@ 0x00000210) Set bits in this register to allow this module
                                                                    to generate the corresponding interrupt.                   */

    struct {
      __IOM uint32_t DSP0INT    : 1;            /*!< [0..0] DSP0 Watchdog Timer Interrupt.                                     */
            uint32_t            : 31;
    } DSP0IEREN_b;
  } ;

  union {
    __IOM uint32_t DSP0IERSTAT;                 /*!< (@ 0x00000214) Read bits from this register to discover the
                                                                    cause of a recent interrupt.                               */

