lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
#define MCUCTRL_SIMOBUCK1_SIMOBUCKRXCLKACTTRIM_Pos (6UL)            /*!< SIMOBUCKRXCLKACTTRIM (Bit 6)                          */
#define MCUCTRL_SIMOBUCK1_SIMOBUCKRXCLKACTTRIM_Msk (0x7c0UL)        /*!< SIMOBUCKRXCLKACTTRIM (Bitfield-Mask: 0x1f)            */
/* =======================================================  SIMOBUCK2  ======================================================= */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKVDDCACTLOWTONTRIM_Pos (24UL)      /*!< SIMOBUCKVDDCACTLOWTONTRIM (Bit 24)                    */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKVDDCACTLOWTONTRIM_Msk (0xf000000UL) /*!< SIMOBUCKVDDCACTLOWTONTRIM (Bitfield-Mask: 0x0f)     */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKVDDCACTHIGHTONTRIM_Pos (11UL)     /*!< SIMOBUCKVDDCACTHIGHTONTRIM (Bit 11)                   */
#define MCUCTRL_SIMOBUCK2_SIMOBUCKVDDCACTHIGHTONTRIM_Msk (0x7800UL) /*!< SIMOBUCKVDDCACTHIGHTONTRIM (Bitfield-Mask: 0x0f)      */
/* =======================================================  SIMOBUCK3  ======================================================= */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPLOWTONTRIM_Pos (26UL)       /*!< SIMOBUCKVDDCLPLOWTONTRIM (Bit 26)                     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPLOWTONTRIM_Msk (0x3c000000UL) /*!< SIMOBUCKVDDCLPLOWTONTRIM (Bitfield-Mask: 0x0f)      */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPLOWTOFFTRIM_Pos (21UL)      /*!< SIMOBUCKVDDCLPLOWTOFFTRIM (Bit 21)                    */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPLOWTOFFTRIM_Msk (0x3e00000UL) /*!< SIMOBUCKVDDCLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)     */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPHIGHTONTRIM_Pos (13UL)      /*!< SIMOBUCKVDDCLPHIGHTONTRIM (Bit 13)                    */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPHIGHTONTRIM_Msk (0x1e000UL) /*!< SIMOBUCKVDDCLPHIGHTONTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPHIGHTOFFTRIM_Pos (8UL)      /*!< SIMOBUCKVDDCLPHIGHTOFFTRIM (Bit 8)                    */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPHIGHTOFFTRIM_Msk (0x1f00UL) /*!< SIMOBUCKVDDCLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)      */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPDRVSTRTRIM_Pos (2UL)        /*!< SIMOBUCKVDDCLPDRVSTRTRIM (Bit 2)                      */
#define MCUCTRL_SIMOBUCK3_SIMOBUCKVDDCLPDRVSTRTRIM_Msk (0xcUL)      /*!< SIMOBUCKVDDCLPDRVSTRTRIM (Bitfield-Mask: 0x03)        */
/* =======================================================  SIMOBUCK4  ======================================================= */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Pos (24UL)            /*!< VDDCLVACTLOWTONTRIM (Bit 24)                          */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTONTRIM_Msk (0xf000000UL)     /*!< VDDCLVACTLOWTONTRIM (Bitfield-Mask: 0x0f)             */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Pos (19UL)           /*!< VDDCLVACTLOWTOFFTRIM (Bit 19)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTLOWTOFFTRIM_Msk (0xf80000UL)     /*!< VDDCLVACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Pos (11UL)           /*!< VDDCLVACTHIGHTONTRIM (Bit 11)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTONTRIM_Msk (0x7800UL)       /*!< VDDCLVACTHIGHTONTRIM (Bitfield-Mask: 0x0f)            */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Pos (6UL)           /*!< VDDCLVACTHIGHTOFFTRIM (Bit 6)                         */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTHIGHTOFFTRIM_Msk (0x7c0UL)       /*!< VDDCLVACTHIGHTOFFTRIM (Bitfield-Mask: 0x1f)           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Pos (0UL)             /*!< VDDCLVACTDRVSTRTRIM (Bit 0)                           */
#define MCUCTRL_SIMOBUCK4_VDDCLVACTDRVSTRTRIM_Msk (0x3UL)           /*!< VDDCLVACTDRVSTRTRIM (Bitfield-Mask: 0x03)             */
/* =======================================================  SIMOBUCK6  ======================================================= */
#define MCUCTRL_SIMOBUCK6_SIMOBUCKVDDFACTHIGHTONTRIM_Pos (17UL)     /*!< SIMOBUCKVDDFACTHIGHTONTRIM (Bit 17)                   */
#define MCUCTRL_SIMOBUCK6_SIMOBUCKVDDFACTHIGHTONTRIM_Msk (0x1e0000UL) /*!< SIMOBUCKVDDFACTHIGHTONTRIM (Bitfield-Mask: 0x0f)    */
/* =======================================================  SIMOBUCK7  ======================================================= */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Pos (18UL)                   /*!< ZXCOMPZXTRIM (Bit 18)                                 */
#define MCUCTRL_SIMOBUCK7_ZXCOMPZXTRIM_Msk (0x7c0000UL)             /*!< ZXCOMPZXTRIM (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Pos (13UL)               /*!< VDDFLPDRVSTRTRIM (Bit 13)                             */
#define MCUCTRL_SIMOBUCK7_VDDFLPDRVSTRTRIM_Msk (0x6000UL)           /*!< VDDFLPDRVSTRTRIM (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Pos (9UL)               /*!< VDDFACTLOWTONTRIM (Bit 9)                             */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTONTRIM_Msk (0x1e00UL)          /*!< VDDFACTLOWTONTRIM (Bitfield-Mask: 0x0f)               */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Pos (4UL)              /*!< VDDFACTLOWTOFFTRIM (Bit 4)                            */
#define MCUCTRL_SIMOBUCK7_VDDFACTLOWTOFFTRIM_Msk (0x1f0UL)          /*!< VDDFACTLOWTOFFTRIM (Bitfield-Mask: 0x1f)              */
/* =======================================================  SIMOBUCK8  ======================================================= */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPLOWTONTRIM_Pos (22UL)       /*!< SIMOBUCKVDDFLPLOWTONTRIM (Bit 22)                     */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPLOWTONTRIM_Msk (0x3c00000UL) /*!< SIMOBUCKVDDFLPLOWTONTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPLOWTOFFTRIM_Pos (17UL)      /*!< SIMOBUCKVDDFLPLOWTOFFTRIM (Bit 17)                    */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPLOWTOFFTRIM_Msk (0x3e0000UL) /*!< SIMOBUCKVDDFLPLOWTOFFTRIM (Bitfield-Mask: 0x1f)      */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPHIGHTONTRIM_Pos (9UL)       /*!< SIMOBUCKVDDFLPHIGHTONTRIM (Bit 9)                     */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPHIGHTONTRIM_Msk (0x1e00UL)  /*!< SIMOBUCKVDDFLPHIGHTONTRIM (Bitfield-Mask: 0x0f)       */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPHIGHTOFFTRIM_Pos (4UL)      /*!< SIMOBUCKVDDFLPHIGHTOFFTRIM (Bit 4)                    */
#define MCUCTRL_SIMOBUCK8_SIMOBUCKVDDFLPHIGHTOFFTRIM_Msk (0x1f0UL)  /*!< SIMOBUCKVDDFLPHIGHTOFFTRIM (Bitfield-Mask: 0x1f)      */
/* =======================================================  SIMOBUCK9  ======================================================= */
#define MCUCTRL_SIMOBUCK9_SIMOBUCKVDDSACTLOWTONTRIM_Pos (22UL)      /*!< SIMOBUCKVDDSACTLOWTONTRIM (Bit 22)                    */
#define MCUCTRL_SIMOBUCK9_SIMOBUCKVDDSACTLOWTONTRIM_Msk (0x3c00000UL) /*!< SIMOBUCKVDDSACTLOWTONTRIM (Bitfield-Mask: 0x0f)     */
#define MCUCTRL_SIMOBUCK9_SIMOBUCKVDDSACTHIGHTONTRIM_Pos (17UL)     /*!< SIMOBUCKVDDSACTHIGHTONTRIM (Bit 17)                   */
#define MCUCTRL_SIMOBUCK9_SIMOBUCKVDDSACTHIGHTONTRIM_Msk (0x1e0000UL) /*!< SIMOBUCKVDDSACTHIGHTONTRIM (Bitfield-Mask: 0x0f)    */
/* ======================================================  SIMOBUCK12  ======================================================= */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Pos (26UL)                    /*!< LPTRIMVDDF (Bit 26)                                   */
#define MCUCTRL_SIMOBUCK12_LPTRIMVDDF_Msk (0xfc000000UL)            /*!< LPTRIMVDDF (Bitfield-Mask: 0x3f)                      */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Pos (20UL)                   /*!< ACTTRIMVDDF (Bit 20)                                  */
#define MCUCTRL_SIMOBUCK12_ACTTRIMVDDF_Msk (0x3f00000UL)            /*!< ACTTRIMVDDF (Bitfield-Mask: 0x3f)                     */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Pos (10UL)              /*!< VDDCLVBRNOUTTRIM (Bit 10)                             */
#define MCUCTRL_SIMOBUCK12_VDDCLVBRNOUTTRIM_Msk (0xffc00UL)         /*!< VDDCLVBRNOUTTRIM (Bitfield-Mask: 0x3ff)               */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Pos (5UL)             /*!< VDDCLVCOMPTRIMPLUS (Bit 5)                            */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMPLUS_Msk (0x3e0UL)         /*!< VDDCLVCOMPTRIMPLUS (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Pos (0UL)            /*!< VDDCLVCOMPTRIMMINUS (Bit 0)                           */
#define MCUCTRL_SIMOBUCK12_VDDCLVCOMPTRIMMINUS_Msk (0x1fUL)         /*!< VDDCLVCOMPTRIMMINUS (Bitfield-Mask: 0x1f)             */
/* ======================================================  SIMOBUCK13  ======================================================= */
#define MCUCTRL_SIMOBUCK13_SIMOBUCKLPTRIMVDDS_Pos (26UL)            /*!< SIMOBUCKLPTRIMVDDS (Bit 26)                           */
#define MCUCTRL_SIMOBUCK13_SIMOBUCKLPTRIMVDDS_Msk (0xfc000000UL)    /*!< SIMOBUCKLPTRIMVDDS (Bitfield-Mask: 0x3f)              */
#define MCUCTRL_SIMOBUCK13_SIMOBUCKACTTRIMVDDS_Pos (20UL)           /*!< SIMOBUCKACTTRIMVDDS (Bit 20)                          */
#define MCUCTRL_SIMOBUCK13_SIMOBUCKACTTRIMVDDS_Msk (0x3f00000UL)    /*!< SIMOBUCKACTTRIMVDDS (Bitfield-Mask: 0x3f)             */
/* ======================================================  SIMOBUCK15  ======================================================= */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Pos (31UL)                 /*!< TRIMLATCHOVER (Bit 31)                                */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Msk (0x80000000UL)         /*!< TRIMLATCHOVER (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Pos (24UL)              /*!< ZXCOMPOFFSETTRIM (Bit 24)                             */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Msk (0x1f000000UL)      /*!< ZXCOMPOFFSETTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Pos (23UL)              /*!< VDDCRXCOMPTRIMEN (Bit 23)                             */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Msk (0x800000UL)        /*!< VDDCRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Pos (22UL)              /*!< VDDFRXCOMPTRIMEN (Bit 22)                             */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Msk (0x400000UL)        /*!< VDDFRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Pos (21UL)              /*!< VDDSRXCOMPTRIMEN (Bit 21)                             */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Msk (0x200000UL)        /*!< VDDSRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Pos (20UL)            /*!< VDDCLVRXCOMPTRIMEN (Bit 20)                           */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Msk (0x100000UL)      /*!< VDDCLVRXCOMPTRIMEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Pos (10UL)                /*!< VDDCBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDCBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Pos (5UL)               /*!< VDDCCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDCCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Pos (0UL)              /*!< VDDCCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDCCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Pos (31UL)              /*!< PWRSWVDDRCPUOVERRIDE (Bit 31)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Msk (0x80000000UL)      /*!< PWRSWVDDRCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Pos (30UL)               /*!< PWRSWVDDRCPUSTATSEL (Bit 30)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Msk (0x40000000UL)       /*!< PWRSWVDDRCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x18000000UL)        /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Pos (23UL)             /*!< PWRSWVDDMDSP1OVERRIDE (Bit 23)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1OVERRIDE_Msk (0x800000UL)       /*!< PWRSWVDDMDSP1OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Pos (22UL)              /*!< PWRSWVDDMDSP1STATSEL (Bit 22)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1STATSEL_Msk (0x400000UL)        /*!< PWRSWVDDMDSP1STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Pos (21UL)               /*!< PWRSWVDDMDSP1DYNSEL (Bit 21)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP1DYNSEL_Msk (0x200000UL)         /*!< PWRSWVDDMDSP1DYNSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Pos (20UL)             /*!< PWRSWVDDMDSP0OVERRIDE (Bit 20)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0OVERRIDE_Msk (0x100000UL)       /*!< PWRSWVDDMDSP0OVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Pos (19UL)              /*!< PWRSWVDDMDSP0STATSEL (Bit 19)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0STATSEL_Msk (0x80000UL)         /*!< PWRSWVDDMDSP0STATSEL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Pos (18UL)               /*!< PWRSWVDDMDSP0DYNSEL (Bit 18)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMDSP0DYNSEL_Msk (0x40000UL)          /*!< PWRSWVDDMDSP0DYNSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Msk (0x8000UL)            /*!< PWRSWVDDMCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Pos (6UL)               /*!< PWRSWVDDCAOROVERRIDE (Bit 6)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Msk (0x40UL)            /*!< PWRSWVDDCAOROVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Pos (4UL)                 /*!< PWRSWVDDCAORDYNSEL (Bit 4)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Msk (0x30UL)              /*!< PWRSWVDDCAORDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Pos (3UL)                /*!< PWRSWVDDCPUOVERRIDE (Bit 3)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Msk (0x8UL)              /*!< PWRSWVDDCPUOVERRIDE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Pos (0UL)                  /*!< PWRSWVDDCPUDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Msk (0x3UL)                /*!< PWRSWVDDCPUDYNSEL (Bitfield-Mask: 0x03)               */
/* ========================================================  PWRSW1  ========================================================= */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Pos (31UL)                /*!< SHORTVDDFVDDSORVAL (Bit 31)                           */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Msk (0x80000000UL)        /*!< SHORTVDDFVDDSORVAL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Pos (30UL)                 /*!< SHORTVDDFVDDSOREN (Bit 30)                            */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Msk (0x40000000UL)         /*!< SHORTVDDFVDDSOREN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Pos (29UL)              /*!< SHORTVDDCVDDCLVORVAL (Bit 29)                         */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Msk (0x20000000UL)      /*!< SHORTVDDCVDDCLVORVAL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Pos (28UL)               /*!< SHORTVDDCVDDCLVOREN (Bit 28)                          */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Msk (0x10000000UL)       /*!< SHORTVDDCVDDCLVOREN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Pos (25UL)               /*!< USEVDDF4VDDRCPUINHP (Bit 25)                          */
#define MCUCTRL_PWRSW1_USEVDDF4VDDRCPUINHP_Msk (0x2000000UL)        /*!< USEVDDF4VDDRCPUINHP (Bitfield-Mask: 0x01)             */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< FW0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< FW0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< FW1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< FW1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT2  ====================================================== */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Pos   (0UL)                     /*!< FW2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Msk   (0xffffffffUL)            /*!< FW2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT3  ====================================================== */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Pos   (0UL)                     /*!< FW3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Msk   (0xffffffffUL)            /*!< FW3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< FR0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< FR0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< FR1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< FR1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT2  ====================================================== */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Pos   (0UL)                     /*!< FR2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Msk   (0xffffffffUL)            /*!< FR2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT3  ====================================================== */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Pos   (0UL)                     /*!< FR3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Msk   (0xffffffffUL)            /*!< FR3BITS (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  DMASRAMWPROT0  ===================================================== */
#define MCUCTRL_DMASRAMWPROT0_DMAWPROT0_Pos (0UL)                   /*!< DMAWPROT0 (Bit 0)                                     */
#define MCUCTRL_DMASRAMWPROT0_DMAWPROT0_Msk (0xffffffffUL)          /*!< DMAWPROT0 (Bitfield-Mask: 0xffffffff)                 */
/* =====================================================  DMASRAMWPROT1  ===================================================== */
#define MCUCTRL_DMASRAMWPROT1_DMAWPROT1_Pos (0UL)                   /*!< DMAWPROT1 (Bit 0)                                     */
#define MCUCTRL_DMASRAMWPROT1_DMAWPROT1_Msk (0xffffUL)              /*!< DMAWPROT1 (Bitfield-Mask: 0xffff)                     */
/* =====================================================  DMASRAMRPROT0  ===================================================== */
#define MCUCTRL_DMASRAMRPROT0_DMARPROT0_Pos (0UL)                   /*!< DMARPROT0 (Bit 0)                                     */
#define MCUCTRL_DMASRAMRPROT0_DMARPROT0_Msk (0xffffffffUL)          /*!< DMARPROT0 (Bitfield-Mask: 0xffffffff)                 */
/* =====================================================  DMASRAMRPROT1  ===================================================== */
#define MCUCTRL_DMASRAMRPROT1_DMARPROT1_Pos (0UL)                   /*!< DMARPROT1 (Bit 0)                                     */
#define MCUCTRL_DMASRAMRPROT1_DMARPROT1_Msk (0xffffUL)              /*!< DMARPROT1 (Bitfield-Mask: 0xffff)                     */
/* ======================================================  USBPHYRESET  ====================================================== */
#define MCUCTRL_USBPHYRESET_USBPHYUTMIRSTDIS_Pos (1UL)              /*!< USBPHYUTMIRSTDIS (Bit 1)                              */
#define MCUCTRL_USBPHYRESET_USBPHYUTMIRSTDIS_Msk (0x2UL)            /*!< USBPHYUTMIRSTDIS (Bitfield-Mask: 0x01)                */
#define MCUCTRL_USBPHYRESET_USBPHYPORRSTDIS_Pos (0UL)               /*!< USBPHYPORRSTDIS (Bit 0)                               */
#define MCUCTRL_USBPHYRESET_USBPHYPORRSTDIS_Msk (0x1UL)             /*!< USBPHYPORRSTDIS (Bitfield-Mask: 0x01)                 */
/* =====================================================  AUDADCPWRCTRL  ===================================================== */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCKEEPOUTEN_Pos (18UL)            /*!< AUDADCKEEPOUTEN (Bit 18)                              */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCKEEPOUTEN_Msk (0x40000UL)       /*!< AUDADCKEEPOUTEN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCRFBUFSLWEN_Pos (17UL)           /*!< AUDADCRFBUFSLWEN (Bit 17)                             */
