lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ==========================================================  CFG  ========================================================== */
#define VCOMP_CFG_LVLSEL_Pos              (16UL)                    /*!< LVLSEL (Bit 16)                                       */
#define VCOMP_CFG_LVLSEL_Msk              (0xf0000UL)               /*!< LVLSEL (Bitfield-Mask: 0x0f)                          */
#define VCOMP_CFG_NSEL_Pos                (8UL)                     /*!< NSEL (Bit 8)                                          */
#define VCOMP_CFG_NSEL_Msk                (0x300UL)                 /*!< NSEL (Bitfield-Mask: 0x03)                            */
#define VCOMP_CFG_PSEL_Pos                (0UL)                     /*!< PSEL (Bit 0)                                          */
#define VCOMP_CFG_PSEL_Msk                (0x3UL)                   /*!< PSEL (Bitfield-Mask: 0x03)                            */
/* =========================================================  STAT  ========================================================== */
#define VCOMP_STAT_PWDSTAT_Pos            (1UL)                     /*!< PWDSTAT (Bit 1)                                       */
#define VCOMP_STAT_PWDSTAT_Msk            (0x2UL)                   /*!< PWDSTAT (Bitfield-Mask: 0x01)                         */
#define VCOMP_STAT_CMPOUT_Pos             (0UL)                     /*!< CMPOUT (Bit 0)                                        */
#define VCOMP_STAT_CMPOUT_Msk             (0x1UL)                   /*!< CMPOUT (Bitfield-Mask: 0x01)                          */
/* ========================================================  PWDKEY  ========================================================= */
#define VCOMP_PWDKEY_PWDKEY_Pos           (0UL)                     /*!< PWDKEY (Bit 0)                                        */
#define VCOMP_PWDKEY_PWDKEY_Msk           (0xffffffffUL)            /*!< PWDKEY (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  INTEN  ========================================================= */
#define VCOMP_INTEN_OUTHI_Pos             (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTEN_OUTHI_Msk             (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTEN_OUTLOW_Pos            (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTEN_OUTLOW_Msk            (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define VCOMP_INTSTAT_OUTHI_Pos           (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTSTAT_OUTHI_Msk           (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTSTAT_OUTLOW_Pos          (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTSTAT_OUTLOW_Msk          (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define VCOMP_INTCLR_OUTHI_Pos            (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTCLR_OUTHI_Msk            (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTCLR_OUTLOW_Pos           (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTCLR_OUTLOW_Msk           (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define VCOMP_INTSET_OUTHI_Pos            (1UL)                     /*!< OUTHI (Bit 1)                                         */
#define VCOMP_INTSET_OUTHI_Msk            (0x2UL)                   /*!< OUTHI (Bitfield-Mask: 0x01)                           */
#define VCOMP_INTSET_OUTLOW_Pos           (0UL)                     /*!< OUTLOW (Bit 0)                                        */
#define VCOMP_INTSET_OUTLOW_Msk           (0x1UL)                   /*!< OUTLOW (Bitfield-Mask: 0x01)                          */


/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
#define WDT_CFG_CLKSEL_Pos                (24UL)                    /*!< CLKSEL (Bit 24)                                       */
#define WDT_CFG_CLKSEL_Msk                (0x7000000UL)             /*!< CLKSEL (Bitfield-Mask: 0x07)                          */
#define WDT_CFG_INTVAL_Pos                (16UL)                    /*!< INTVAL (Bit 16)                                       */
#define WDT_CFG_INTVAL_Msk                (0xff0000UL)              /*!< INTVAL (Bitfield-Mask: 0xff)                          */
#define WDT_CFG_RESVAL_Pos                (8UL)                     /*!< RESVAL (Bit 8)                                        */
#define WDT_CFG_RESVAL_Msk                (0xff00UL)                /*!< RESVAL (Bitfield-Mask: 0xff)                          */
#define WDT_CFG_DSPRESETINTEN_Pos         (3UL)                     /*!< DSPRESETINTEN (Bit 3)                                 */
#define WDT_CFG_DSPRESETINTEN_Msk         (0x8UL)                   /*!< DSPRESETINTEN (Bitfield-Mask: 0x01)                   */
#define WDT_CFG_RESEN_Pos                 (2UL)                     /*!< RESEN (Bit 2)                                         */
#define WDT_CFG_RESEN_Msk                 (0x4UL)                   /*!< RESEN (Bitfield-Mask: 0x01)                           */
#define WDT_CFG_INTEN_Pos                 (1UL)                     /*!< INTEN (Bit 1)                                         */
#define WDT_CFG_INTEN_Msk                 (0x2UL)                   /*!< INTEN (Bitfield-Mask: 0x01)                           */
#define WDT_CFG_WDTEN_Pos                 (0UL)                     /*!< WDTEN (Bit 0)                                         */
#define WDT_CFG_WDTEN_Msk                 (0x1UL)                   /*!< WDTEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  RSTRT  ========================================================= */
#define WDT_RSTRT_RSTRT_Pos               (0UL)                     /*!< RSTRT (Bit 0)                                         */
#define WDT_RSTRT_RSTRT_Msk               (0xffUL)                  /*!< RSTRT (Bitfield-Mask: 0xff)                           */
/* =========================================================  LOCK  ========================================================== */
#define WDT_LOCK_LOCK_Pos                 (0UL)                     /*!< LOCK (Bit 0)                                          */
#define WDT_LOCK_LOCK_Msk                 (0xffUL)                  /*!< LOCK (Bitfield-Mask: 0xff)                            */
/* =========================================================  COUNT  ========================================================= */
#define WDT_COUNT_COUNT_Pos               (0UL)                     /*!< COUNT (Bit 0)                                         */
#define WDT_COUNT_COUNT_Msk               (0xffUL)                  /*!< COUNT (Bitfield-Mask: 0xff)                           */
/* ========================================================  DSP0CFG  ======================================================== */
#define WDT_DSP0CFG_DSP0PMRESVAL_Pos      (24UL)                    /*!< DSP0PMRESVAL (Bit 24)                                 */
#define WDT_DSP0CFG_DSP0PMRESVAL_Msk      (0xff000000UL)            /*!< DSP0PMRESVAL (Bitfield-Mask: 0xff)                    */
#define WDT_DSP0CFG_DSP0INTVAL_Pos        (16UL)                    /*!< DSP0INTVAL (Bit 16)                                   */
#define WDT_DSP0CFG_DSP0INTVAL_Msk        (0xff0000UL)              /*!< DSP0INTVAL (Bitfield-Mask: 0xff)                      */
#define WDT_DSP0CFG_DSP0RESVAL_Pos        (8UL)                     /*!< DSP0RESVAL (Bit 8)                                    */
#define WDT_DSP0CFG_DSP0RESVAL_Msk        (0xff00UL)                /*!< DSP0RESVAL (Bitfield-Mask: 0xff)                      */
#define WDT_DSP0CFG_DSP0PMRESEN_Pos       (3UL)                     /*!< DSP0PMRESEN (Bit 3)                                   */
#define WDT_DSP0CFG_DSP0PMRESEN_Msk       (0x8UL)                   /*!< DSP0PMRESEN (Bitfield-Mask: 0x01)                     */
#define WDT_DSP0CFG_DSP0RESEN_Pos         (2UL)                     /*!< DSP0RESEN (Bit 2)                                     */
#define WDT_DSP0CFG_DSP0RESEN_Msk         (0x4UL)                   /*!< DSP0RESEN (Bitfield-Mask: 0x01)                       */
#define WDT_DSP0CFG_DSP0INTEN_Pos         (1UL)                     /*!< DSP0INTEN (Bit 1)                                     */
#define WDT_DSP0CFG_DSP0INTEN_Msk         (0x2UL)                   /*!< DSP0INTEN (Bitfield-Mask: 0x01)                       */
#define WDT_DSP0CFG_DSP0WDTEN_Pos         (0UL)                     /*!< DSP0WDTEN (Bit 0)                                     */
#define WDT_DSP0CFG_DSP0WDTEN_Msk         (0x1UL)                   /*!< DSP0WDTEN (Bitfield-Mask: 0x01)                       */
/* =======================================================  DSP0RSTRT  ======================================================= */
#define WDT_DSP0RSTRT_DSP0RSTART_Pos      (0UL)                     /*!< DSP0RSTART (Bit 0)                                    */
#define WDT_DSP0RSTRT_DSP0RSTART_Msk      (0xffUL)                  /*!< DSP0RSTART (Bitfield-Mask: 0xff)                      */
/* =======================================================  DSP0TLOCK  ======================================================= */
#define WDT_DSP0TLOCK_DSP0LOCK_Pos        (0UL)                     /*!< DSP0LOCK (Bit 0)                                      */
#define WDT_DSP0TLOCK_DSP0LOCK_Msk        (0xffUL)                  /*!< DSP0LOCK (Bitfield-Mask: 0xff)                        */
/* =======================================================  DSP0COUNT  ======================================================= */
#define WDT_DSP0COUNT_DSP0COUNT_Pos       (0UL)                     /*!< DSP0COUNT (Bit 0)                                     */
#define WDT_DSP0COUNT_DSP0COUNT_Msk       (0xffUL)                  /*!< DSP0COUNT (Bitfield-Mask: 0xff)                       */
/* ========================================================  DSP1CFG  ======================================================== */
#define WDT_DSP1CFG_DSP1PMRESVAL_Pos      (24UL)                    /*!< DSP1PMRESVAL (Bit 24)                                 */
#define WDT_DSP1CFG_DSP1PMRESVAL_Msk      (0xff000000UL)            /*!< DSP1PMRESVAL (Bitfield-Mask: 0xff)                    */
#define WDT_DSP1CFG_DSP1INTVAL_Pos        (16UL)                    /*!< DSP1INTVAL (Bit 16)                                   */
#define WDT_DSP1CFG_DSP1INTVAL_Msk        (0xff0000UL)              /*!< DSP1INTVAL (Bitfield-Mask: 0xff)                      */
#define WDT_DSP1CFG_DSP1RESVAL_Pos        (8UL)                     /*!< DSP1RESVAL (Bit 8)                                    */
#define WDT_DSP1CFG_DSP1RESVAL_Msk        (0xff00UL)                /*!< DSP1RESVAL (Bitfield-Mask: 0xff)                      */
#define WDT_DSP1CFG_DSP1PMRESEN_Pos       (3UL)                     /*!< DSP1PMRESEN (Bit 3)                                   */
#define WDT_DSP1CFG_DSP1PMRESEN_Msk       (0x8UL)                   /*!< DSP1PMRESEN (Bitfield-Mask: 0x01)                     */
#define WDT_DSP1CFG_DSP1RESEN_Pos         (2UL)                     /*!< DSP1RESEN (Bit 2)                                     */
#define WDT_DSP1CFG_DSP1RESEN_Msk         (0x4UL)                   /*!< DSP1RESEN (Bitfield-Mask: 0x01)                       */
#define WDT_DSP1CFG_DSP1INTEN_Pos         (1UL)                     /*!< DSP1INTEN (Bit 1)                                     */
#define WDT_DSP1CFG_DSP1INTEN_Msk         (0x2UL)                   /*!< DSP1INTEN (Bitfield-Mask: 0x01)                       */
#define WDT_DSP1CFG_DSP1WDTEN_Pos         (0UL)                     /*!< DSP1WDTEN (Bit 0)                                     */
#define WDT_DSP1CFG_DSP1WDTEN_Msk         (0x1UL)                   /*!< DSP1WDTEN (Bitfield-Mask: 0x01)                       */
/* =======================================================  DSP1RSTRT  ======================================================= */
#define WDT_DSP1RSTRT_DSP1RSTART_Pos      (0UL)                     /*!< DSP1RSTART (Bit 0)                                    */
#define WDT_DSP1RSTRT_DSP1RSTART_Msk      (0xffUL)                  /*!< DSP1RSTART (Bitfield-Mask: 0xff)                      */
/* =======================================================  DSP1TLOCK  ======================================================= */
#define WDT_DSP1TLOCK_DSP1LOCK_Pos        (0UL)                     /*!< DSP1LOCK (Bit 0)                                      */
#define WDT_DSP1TLOCK_DSP1LOCK_Msk        (0xffUL)                  /*!< DSP1LOCK (Bitfield-Mask: 0xff)                        */
/* =======================================================  DSP1COUNT  ======================================================= */
#define WDT_DSP1COUNT_DSP1COUNT_Pos       (0UL)                     /*!< DSP1COUNT (Bit 0)                                     */
#define WDT_DSP1COUNT_DSP1COUNT_Msk       (0xffUL)                  /*!< DSP1COUNT (Bitfield-Mask: 0xff)                       */
/* =======================================================  WDTIEREN  ======================================================== */
#define WDT_WDTIEREN_DSPRESETINT_Pos      (1UL)                     /*!< DSPRESETINT (Bit 1)                                   */
#define WDT_WDTIEREN_DSPRESETINT_Msk      (0x2UL)                   /*!< DSPRESETINT (Bitfield-Mask: 0x01)                     */
#define WDT_WDTIEREN_WDTINT_Pos           (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIEREN_WDTINT_Msk           (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* ======================================================  WDTIERSTAT  ======================================================= */
#define WDT_WDTIERSTAT_DSPRESETINT_Pos    (1UL)                     /*!< DSPRESETINT (Bit 1)                                   */
#define WDT_WDTIERSTAT_DSPRESETINT_Msk    (0x2UL)                   /*!< DSPRESETINT (Bitfield-Mask: 0x01)                     */
#define WDT_WDTIERSTAT_WDTINT_Pos         (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERSTAT_WDTINT_Msk         (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERCLR  ======================================================= */
#define WDT_WDTIERCLR_DSPRESETINT_Pos     (1UL)                     /*!< DSPRESETINT (Bit 1)                                   */
#define WDT_WDTIERCLR_DSPRESETINT_Msk     (0x2UL)                   /*!< DSPRESETINT (Bitfield-Mask: 0x01)                     */
#define WDT_WDTIERCLR_WDTINT_Pos          (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERCLR_WDTINT_Msk          (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  WDTIERSET  ======================================================= */
#define WDT_WDTIERSET_DSPRESETINT_Pos     (1UL)                     /*!< DSPRESETINT (Bit 1)                                   */
#define WDT_WDTIERSET_DSPRESETINT_Msk     (0x2UL)                   /*!< DSPRESETINT (Bitfield-Mask: 0x01)                     */
#define WDT_WDTIERSET_WDTINT_Pos          (0UL)                     /*!< WDTINT (Bit 0)                                        */
#define WDT_WDTIERSET_WDTINT_Msk          (0x1UL)                   /*!< WDTINT (Bitfield-Mask: 0x01)                          */
/* =======================================================  DSP0IEREN  ======================================================= */
#define WDT_DSP0IEREN_DSP0INT_Pos         (0UL)                     /*!< DSP0INT (Bit 0)                                       */
#define WDT_DSP0IEREN_DSP0INT_Msk         (0x1UL)                   /*!< DSP0INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP0IERSTAT  ====================================================== */
#define WDT_DSP0IERSTAT_DSP0INT_Pos       (0UL)                     /*!< DSP0INT (Bit 0)                                       */
#define WDT_DSP0IERSTAT_DSP0INT_Msk       (0x1UL)                   /*!< DSP0INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP0IERCLR  ======================================================= */
#define WDT_DSP0IERCLR_DSP0INT_Pos        (0UL)                     /*!< DSP0INT (Bit 0)                                       */
#define WDT_DSP0IERCLR_DSP0INT_Msk        (0x1UL)                   /*!< DSP0INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP0IERSET  ======================================================= */
#define WDT_DSP0IERSET_DSP0INT_Pos        (0UL)                     /*!< DSP0INT (Bit 0)                                       */
#define WDT_DSP0IERSET_DSP0INT_Msk        (0x1UL)                   /*!< DSP0INT (Bitfield-Mask: 0x01)                         */
/* =======================================================  DSP1IEREN  ======================================================= */
#define WDT_DSP1IEREN_DSP1INT_Pos         (0UL)                     /*!< DSP1INT (Bit 0)                                       */
#define WDT_DSP1IEREN_DSP1INT_Msk         (0x1UL)                   /*!< DSP1INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP1IERSTAT  ====================================================== */
#define WDT_DSP1IERSTAT_DSP1INT_Pos       (0UL)                     /*!< DSP1INT (Bit 0)                                       */
#define WDT_DSP1IERSTAT_DSP1INT_Msk       (0x1UL)                   /*!< DSP1INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP1IERCLR  ======================================================= */
#define WDT_DSP1IERCLR_DSP1INT_Pos        (0UL)                     /*!< DSP1INT (Bit 0)                                       */
#define WDT_DSP1IERCLR_DSP1INT_Msk        (0x1UL)                   /*!< DSP1INT (Bitfield-Mask: 0x01)                         */
/* ======================================================  DSP1IERSET  ======================================================= */
#define WDT_DSP1IERSET_DSP1INT_Pos        (0UL)                     /*!< DSP1INT (Bit 0)                                       */
#define WDT_DSP1IERSET_DSP1INT_Msk        (0x1UL)                   /*!< DSP1INT (Bitfield-Mask: 0x01)                         */

/** @} */ /* End of group PosMask_peripherals */


/* =========================================================================================================================== */
/* ================                           Enumerated Values Peripheral Section                            ================ */
/* =========================================================================================================================== */


/** @addtogroup EnumValue_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ================================================  ADC CFG CLKSEL [24..25]  ================================================ */
typedef enum {                                  /*!< ADC_CFG_CLKSEL                                                            */
  ADC_CFG_CLKSEL_HFRC_48MHZ            = 0,     /*!< HFRC_48MHZ : This setting must not be used for CLKSEL for the
                                                     GP ADC even though it is the default setting. Software
                                                     must set CLKSEL to HFRC_24MHZ after any reset event and
                                                     before enabling the ADC.                                                  */
  ADC_CFG_CLKSEL_HFRC_48MHZ1           = 1,     /*!< HFRC_48MHZ1 : This setting must not be used for CLKSEL for the
                                                     GP ADC.                                                                   */
  ADC_CFG_CLKSEL_HFRC_24MHZ            = 2,     /*!< HFRC_24MHZ : HFRC clock at 24 MHz. This setting is the only
                                                     valid setting for the GP ADC.                                             */
  ADC_CFG_CLKSEL_HFRC2_48MHZ           = 3,     /*!< HFRC2_48MHZ : This setting must not be used for CLKSEL for the
                                                     GP ADC.                                                                   */
} ADC_CFG_CLKSEL_Enum;

