lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* =========================================  DC LAYER1MODE LAYER1COLORMODE [0..4]  ========================================== */
typedef enum {                                  /*!< DC_LAYER1MODE_LAYER1COLORMODE                                             */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_LUTBLE = 0,/*!< LAYER1_LUTBLE : 8-bit color palette look-up table (LUT8)                */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_RGBX5551 = 1,/*!< LAYER1_RGBX5551 : 16-bit RGBX5551 color format                        */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_RGBX8888 = 2,/*!< LAYER1_RGBX8888 : 32-bit RGBX8888 color format                        */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_RGB332 = 4,/*!< LAYER1_RGB332 : 8-bit RGB332 color format                               */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_RGB565 = 5,/*!< LAYER1_RGB565 : 16-bit RGB565 color format                              */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_XRGB8888 = 6,/*!< LAYER1_XRGB8888 : 32-bit XRGB8888 color format                        */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_L8 = 7,  /*!< LAYER1_L8 : L8 Grayscale/Palette format                                   */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_L1 = 8,  /*!< LAYER1_L1 : L1 Grayscale/Palette format                                   */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_L4 = 9,  /*!< LAYER1_L4 : L4 Grayscale/Palette format                                   */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_YUYV = 10,/*!< LAYER1_YUYV : YUYV color format                                          */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_RGB = 11,/*!< LAYER1_RGB : 24-bit RGB color format                                      */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_YUY2 = 12,/*!< LAYER1_YUY2 : YUY2 color format                                          */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_ABGR8888 = 13,/*!< LAYER1_ABGR8888 : 32-bit ABGR8888 color format                       */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_BGRA8888 = 14,/*!< LAYER1_BGRA8888 : 32-bit BGRA8888 color format                       */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_VIDEO420 = 16,/*!< LAYER1_VIDEO420 : Video 420 Mode                                     */
  DC_LAYER1MODE_LAYER1COLORMODE_LAYER1_TRILIN420 = 17,/*!< LAYER1_TRILIN420 : Trilinear 420 Video Mode                         */
} DC_LAYER1MODE_LAYER1COLORMODE_Enum;

/* =====================================================  LAYER1STARTXY  ===================================================== */
/* =====================================================  LAYER1SIZEXY  ====================================================== */
/* ======================================================  LAYER1ADDR  ======================================================= */
/* =====================================================  LAYER1STRIDE  ====================================================== */
/* ======================================  DC LAYER1STRIDE LAYER1AXIFIFOTHLD [19..20]  ======================================= */
typedef enum {                                  /*!< DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD                                         */
  DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_LAYER1_BURST_HALF_SZ = 0,/*!< LAYER1_BURST_HALF_SZ : half fifo (default)                   */
  DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_LAYER1_BURST_2 = 1,/*!< LAYER1_BURST_2 : 2 burst-size                                      */
  DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_LAYER1_BURST_4 = 2,/*!< LAYER1_BURST_4 : 4 burst-size                                      */
  DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_LAYER1_BURST_8 = 3,/*!< LAYER1_BURST_8 : 8 burst-size                                      */
} DC_LAYER1STRIDE_LAYER1AXIFIFOTHLD_Enum;

/* ======================================  DC LAYER1STRIDE LAYER1AXIBURSTBITS [16..18]  ====================================== */
typedef enum {                                  /*!< DC_LAYER1STRIDE_LAYER1AXIBURSTBITS                                        */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_DEF = 0,/*!< LAYER1_BEATS_DEF : 16-beats (default)                           */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_2 = 1,/*!< LAYER1_BEATS_2 : 2-beats                                          */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_4 = 2,/*!< LAYER1_BEATS_4 : 4-beats                                          */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_8 = 3,/*!< LAYER1_BEATS_8 : 8-beats                                          */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_16 = 4,/*!< LAYER1_BEATS_16 : 16-beats (CHECK mistake?)                      */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_32 = 5,/*!< LAYER1_BEATS_32 : 32-beats (AXI4 only)                           */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_64 = 6,/*!< LAYER1_BEATS_64 : 64-beats (AXI4 only)                           */
  DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_LAYER1_BEATS_128 = 7,/*!< LAYER1_BEATS_128 : 128-beats (AXI4 only)                        */
} DC_LAYER1STRIDE_LAYER1AXIBURSTBITS_Enum;

/* ======================================================  LAYER1RESXY  ====================================================== */
/* =====================================================  LAYER1SCALEX  ====================================================== */
/* =====================================================  LAYER1SCALEY  ====================================================== */
/* ======================================================  LAYER2MODE  ======================================================= */
/* ==========================================  DC LAYER2MODE LAYER2DBLEND [12..15]  ========================================== */
typedef enum {                                  /*!< DC_LAYER2MODE_LAYER2DBLEND                                                */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DBLACK_BLEND = 0,/*!< LAYER2_DBLACK_BLEND : blend black                                    */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DWHITE_BLEND = 1,/*!< LAYER2_DWHITE_BLEND : blend white                                    */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DALBHAS_BLEND = 2,/*!< LAYER2_DALBHAS_BLEND : blend alpha source                           */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DALPHAG_BLEND = 3,/*!< LAYER2_DALPHAG_BLEND : blend alpha global                           */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DALPHASG_BLEND = 4,/*!< LAYER2_DALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DINVERT_BLEND_SRC = 5,/*!< LAYER2_DINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DINVERT_GLOBAL_BLEND = 6,/*!< LAYER2_DINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DINVERTSG_BLEND = 7,/*!< LAYER2_DINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DALPHA_BLEND = 10,/*!< LAYER2_DALPHA_BLEND : blend alpha destination                       */
  DC_LAYER2MODE_LAYER2DBLEND_LAYER2_DINVERT_BLEND_DST = 13,/*!< LAYER2_DINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER2MODE_LAYER2DBLEND_Enum;

/* ==========================================  DC LAYER2MODE LAYER2SBLEND [8..11]  =========================================== */
typedef enum {                                  /*!< DC_LAYER2MODE_LAYER2SBLEND                                                */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SBLACK_BLEND = 0,/*!< LAYER2_SBLACK_BLEND : blend black                                    */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SWHITE_BLEND = 1,/*!< LAYER2_SWHITE_BLEND : blend white                                    */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SALBHAS_BLEND = 2,/*!< LAYER2_SALBHAS_BLEND : blend alpha source                           */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SALPHAG_BLEND = 3,/*!< LAYER2_SALPHAG_BLEND : blend alpha global                           */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SALPHASG_BLEND = 4,/*!< LAYER2_SALPHASG_BLEND : blend alpha source and alpha global        */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SINVERT_BLEND_SRC = 5,/*!< LAYER2_SINVERT_BLEND_SRC : blend inverted source                */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SINVERT_GLOBAL_BLEND = 6,/*!< LAYER2_SINVERT_GLOBAL_BLEND : blend inverted global          */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SINVERTSG_BLEND = 7,/*!< LAYER2_SINVERTSG_BLEND : blend inverted source and inverted
                                                     global                                                                    */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SALPHA_BLEND = 10,/*!< LAYER2_SALPHA_BLEND : blend alpha destination                       */
  DC_LAYER2MODE_LAYER2SBLEND_LAYER2_SINVERT_BLEND_DST = 13,/*!< LAYER2_SINVERT_BLEND_DST : blend inverted destination          */
} DC_LAYER2MODE_LAYER2SBLEND_Enum;

