lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ==========================================  PWRCTRL SRAMCTRL SRAMCLKGATE [1..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_SRAMCTRL_SRAMCLKGATE                                              */
  PWRCTRL_SRAMCTRL_SRAMCLKGATE_EN      = 1,     /*!< EN : Enable Individual SRAM Clock Gating                                  */
  PWRCTRL_SRAMCTRL_SRAMCLKGATE_DIS     = 0,     /*!< DIS : Disables Individual SRAM Clock Gating                               */
} PWRCTRL_SRAMCTRL_SRAMCLKGATE_Enum;

/* =======================================================  ADCSTATUS  ======================================================= */
/* =====================================================  AUDADCSTATUS  ====================================================== */
/* =======================================================  EMONCTRL  ======================================================== */
/* =======================================================  EMONCFG0  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG0 EMONSEL0 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG0_EMONSEL0                                                 */
  PWRCTRL_EMONCFG0_EMONSEL0_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG0_EMONSEL0_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG0_EMONSEL0_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG0_EMONSEL0_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG0_EMONSEL0_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG0_EMONSEL0_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG0_EMONSEL0_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG0_EMONSEL0_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG0_EMONSEL0_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG0_EMONSEL0_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG0_EMONSEL0_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG0_EMONSEL0_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG0_EMONSEL0_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG0_EMONSEL0_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG0_EMONSEL0_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG0_EMONSEL0_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG0_EMONSEL0_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG0_EMONSEL0_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG0_EMONSEL0_Enum;

/* =======================================================  EMONCFG1  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG1 EMONSEL1 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG1_EMONSEL1                                                 */
  PWRCTRL_EMONCFG1_EMONSEL1_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG1_EMONSEL1_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG1_EMONSEL1_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG1_EMONSEL1_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG1_EMONSEL1_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG1_EMONSEL1_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG1_EMONSEL1_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG1_EMONSEL1_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG1_EMONSEL1_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG1_EMONSEL1_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG1_EMONSEL1_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG1_EMONSEL1_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG1_EMONSEL1_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG1_EMONSEL1_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG1_EMONSEL1_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG1_EMONSEL1_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG1_EMONSEL1_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG1_EMONSEL1_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG1_EMONSEL1_Enum;

/* =======================================================  EMONCFG2  ======================================================== */
/* ===========================================  PWRCTRL EMONCFG2 EMONSEL2 [0..7]  ============================================ */
typedef enum {                                  /*!< PWRCTRL_EMONCFG2_EMONSEL2                                                 */
  PWRCTRL_EMONCFG2_EMONSEL2_NEVER      = 0,     /*!< NEVER : Never increment the counter                                       */
  PWRCTRL_EMONCFG2_EMONSEL2_ALWAYS     = 1,     /*!< ALWAYS : Always increment the counter                                     */
  PWRCTRL_EMONCFG2_EMONSEL2_MCUSLEEP   = 2,     /*!< MCUSLEEP : Increment the counter for MCU sleep mode                       */
  PWRCTRL_EMONCFG2_EMONSEL2_MCUDEEPSLEEP = 3,   /*!< MCUDEEPSLEEP : Increment the counter for MCU deepsleep mode               */
  PWRCTRL_EMONCFG2_EMONSEL2_DSP0ON     = 4,     /*!< DSP0ON : Increment the counter for DSP0 active mode                       */
  PWRCTRL_EMONCFG2_EMONSEL2_DSP1ON     = 5,     /*!< DSP1ON : Increment the counter for DSP1 active mode                       */
  PWRCTRL_EMONCFG2_EMONSEL2_ADCON      = 6,     /*!< ADCON : Increment the counter when ADC is powered on                      */
  PWRCTRL_EMONCFG2_EMONSEL2_AUDPBON    = 7,     /*!< AUDPBON : Increment the counter when AUDPB is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_AUDRECON   = 8,     /*!< AUDRECON : Increment the counter when AUDREC is powered on                */
  PWRCTRL_EMONCFG2_EMONSEL2_I2S0ON     = 9,     /*!< I2S0ON : Increment the counter when I2S0 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_I2S1ON     = 10,    /*!< I2S1ON : Increment the counter when I2S1 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_PDM0ON     = 11,    /*!< PDM0ON : Increment the counter when PDM0 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_PDM1ON     = 12,    /*!< PDM1ON : Increment the counter when PDM1 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_PDM2ON     = 13,    /*!< PDM2ON : Increment the counter when PDM2 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_PDM3ON     = 14,    /*!< PDM3ON : Increment the counter when PDM3 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_AUDADCON   = 15,    /*!< AUDADCON : Increment the counter when AUDADC is powered on                */
  PWRCTRL_EMONCFG2_EMONSEL2_CRYPTOON   = 16,    /*!< CRYPTOON : Increment the counter when CRYPTO is powered on                */
  PWRCTRL_EMONCFG2_EMONSEL2_DBGON      = 17,    /*!< DBGON : Increment the counter when DBG is powered on                      */
  PWRCTRL_EMONCFG2_EMONSEL2_DISPON     = 18,    /*!< DISPON : Increment the counter when DISP is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_DISPPHYON  = 19,    /*!< DISPPHYON : Increment the counter when DISPPHY is powered on              */
  PWRCTRL_EMONCFG2_EMONSEL2_DSPAON     = 20,    /*!< DSPAON : Increment the counter when DSPA is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_GFXON      = 21,    /*!< GFXON : Increment the counter when GFX is powered on                      */
  PWRCTRL_EMONCFG2_EMONSEL2_UART0ON    = 22,    /*!< UART0ON : Increment the counter when UART0 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_UART1ON    = 23,    /*!< UART1ON : Increment the counter when UART1 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_UART2ON    = 24,    /*!< UART2ON : Increment the counter when UART2 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_UART3ON    = 25,    /*!< UART3ON : Increment the counter when UART3 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM0ON     = 26,    /*!< IOM0ON : Increment the counter when IOM0 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM1ON     = 27,    /*!< IOM1ON : Increment the counter when IOM1 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM2ON     = 28,    /*!< IOM2ON : Increment the counter when IOM2 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM3ON     = 29,    /*!< IOM3ON : Increment the counter when IOM3 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM4ON     = 32,    /*!< IOM4ON : Increment the counter when IOM4 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM5ON     = 33,    /*!< IOM5ON : Increment the counter when IOM5 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM6ON     = 34,    /*!< IOM6ON : Increment the counter when IOM6 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOM7ON     = 35,    /*!< IOM7ON : Increment the counter when IOM7 is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_IOSON      = 36,    /*!< IOSON : Increment the counter when IOS is powered on                      */
  PWRCTRL_EMONCFG2_EMONSEL2_MSPI0ON    = 37,    /*!< MSPI0ON : Increment the counter when MSPI0 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_MSPI1ON    = 38,    /*!< MSPI1ON : Increment the counter when MSPI1 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_MSPI2ON    = 39,    /*!< MSPI2ON : Increment the counter when MSPI2 is powered on                  */
  PWRCTRL_EMONCFG2_EMONSEL2_SDIOON     = 40,    /*!< SDIOON : Increment the counter when SDIO is powered on                    */
  PWRCTRL_EMONCFG2_EMONSEL2_USBON      = 41,    /*!< USBON : Increment the counter when USB is powered on                      */
  PWRCTRL_EMONCFG2_EMONSEL2_USBPHYON   = 42,    /*!< USBPHYON : Increment the counter when USBPHY is powered on                */
} PWRCTRL_EMONCFG2_EMONSEL2_Enum;

