lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ===========================================  SDIO CAPABILITIES1 SDR104 [1..1]  ============================================ */
typedef enum {                                  /*!< SDIO_CAPABILITIES1_SDR104                                                 */
  SDIO_CAPABILITIES1_SDR104_SUPPORTED  = 1,     /*!< SUPPORTED : SDR104 is Not Supported                                       */
  SDIO_CAPABILITIES1_SDR104_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : SDR104 is Not Supported                                    */
} SDIO_CAPABILITIES1_SDR104_Enum;

/* ============================================  SDIO CAPABILITIES1 SDR50 [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO_CAPABILITIES1_SDR50                                                  */
  SDIO_CAPABILITIES1_SDR50_SUPPORTED   = 1,     /*!< SUPPORTED : SDR50 is Not Supported                                        */
  SDIO_CAPABILITIES1_SDR50_NOTSUPPORTED = 0,    /*!< NOTSUPPORTED : SDR50 is Not Supported                                     */
} SDIO_CAPABILITIES1_SDR50_Enum;

/* =======================================================  MAXIMUM0  ======================================================== */
/* =======================================================  MAXIMUM1  ======================================================== */
/* ===========================================  SDIO MAXIMUM1 MAXCURR18V [16..23]  =========================================== */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR18V                                                  */
  SDIO_MAXIMUM1_MAXCURR18V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR18V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR18V_Enum;

/* ===========================================  SDIO MAXIMUM1 MAXCURR30V [8..15]  ============================================ */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR30V                                                  */
  SDIO_MAXIMUM1_MAXCURR30V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR30V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR30V_Enum;

/* ============================================  SDIO MAXIMUM1 MAXCURR33V [0..7]  ============================================ */
typedef enum {                                  /*!< SDIO_MAXIMUM1_MAXCURR33V                                                  */
  SDIO_MAXIMUM1_MAXCURR33V_1020mA      = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO_MAXIMUM1_MAXCURR33V_4mA         = 1,     /*!< 4mA : 1020mA, 255 * 4mA                                                   */
} SDIO_MAXIMUM1_MAXCURR33V_Enum;

/* =========================================================  FORCE  ========================================================= */
/* ===========================================  SDIO FORCE FORCEADMAERR [25..25]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEADMAERR                                                   */
  SDIO_FORCE_FORCEADMAERR_INT          = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEADMAERR_NOINT        = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEADMAERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDERR [24..24]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDERR                                                   */
  SDIO_FORCE_FORCEACMDERR_INT          = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDERR_NOINT        = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEACMDERR_Enum;

/* =========================================  SDIO FORCE FORCECURRLIMITERR [23..23]  ========================================= */
typedef enum {                                  /*!< SDIO_FORCE_FORCECURRLIMITERR                                              */
  SDIO_FORCE_FORCECURRLIMITERR_INT     = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECURRLIMITERR_NOINT   = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECURRLIMITERR_Enum;

/* ==========================================  SDIO FORCE FORCEDATAENDERR [22..22]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATAENDERR                                                */
  SDIO_FORCE_FORCEDATAENDERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATAENDERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATAENDERR_Enum;

/* ==========================================  SDIO FORCE FORCEDATACRCERR [21..21]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATACRCERR                                                */
  SDIO_FORCE_FORCEDATACRCERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATACRCERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATACRCERR_Enum;

