lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ==========================================  SDIO FORCE FORCEDATATOERR [20..20]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEDATATOERR                                                 */
  SDIO_FORCE_FORCEDATATOERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEDATATOERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCEDATATOERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDIDXERR [19..19]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDIDXERR                                                 */
  SDIO_FORCE_FORCECMDIDXERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDIDXERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDIDXERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDENDERR [18..18]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDENDERR                                                 */
  SDIO_FORCE_FORCECMDENDERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDENDERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDENDERR_Enum;

/* ==========================================  SDIO FORCE FORCECMDCRCERR [17..17]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDCRCERR                                                 */
  SDIO_FORCE_FORCECMDCRCERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDCRCERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDCRCERR_Enum;

/* ===========================================  SDIO FORCE FORCECMDTOERR [16..16]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCECMDTOERR                                                  */
  SDIO_FORCE_FORCECMDTOERR_INT         = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCECMDTOERR_NOINT       = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO_FORCE_FORCECMDTOERR_Enum;

/* =========================================  SDIO FORCE FORCEACMDISSUEDERR [7..7]  ========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDISSUEDERR                                             */
  SDIO_FORCE_FORCEACMDISSUEDERR_INT    = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDISSUEDERR_NOINT  = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDISSUEDERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDIDXERR [4..4]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDIDXERR                                                */
  SDIO_FORCE_FORCEACMDIDXERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDIDXERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDIDXERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDENDERR [3..3]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDENDERR                                                */
  SDIO_FORCE_FORCEACMDENDERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDENDERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDENDERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDCRCERR [2..2]  =========================================== */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDCRCERR                                                */
  SDIO_FORCE_FORCEACMDCRCERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDCRCERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDCRCERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMDTOERR [1..1]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMDTOERR                                                 */
  SDIO_FORCE_FORCEACMDTOERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMDTOERR_NOINT      = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMDTOERR_Enum;

/* ===========================================  SDIO FORCE FORCEACMD12NOT [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO_FORCE_FORCEACMD12NOT                                                 */
  SDIO_FORCE_FORCEACMD12NOT_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO_FORCE_FORCEACMD12NOT_NOINT      = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO_FORCE_FORCEACMD12NOT_Enum;

/* =========================================================  ADMA  ========================================================== */
/* ==========================================  SDIO ADMA ADMALENMISMATCHERR [2..2]  ========================================== */
typedef enum {                                  /*!< SDIO_ADMA_ADMALENMISMATCHERR                                              */
  SDIO_ADMA_ADMALENMISMATCHERR_ERROR   = 1,     /*!< ERROR : Error                                                             */
  SDIO_ADMA_ADMALENMISMATCHERR_NOERROR = 0,     /*!< NOERROR : No error                                                        */
} SDIO_ADMA_ADMALENMISMATCHERR_Enum;

/* ============================================  SDIO ADMA ADMAERRORSTATE [0..1]  ============================================ */
typedef enum {                                  /*!< SDIO_ADMA_ADMAERRORSTATE                                                  */
  SDIO_ADMA_ADMAERRORSTATE_STDMA       = 0,     /*!< STDMA : ST_STOP (Stop DMA) Points to next of the error descriptor         */
  SDIO_ADMA_ADMAERRORSTATE_FETCHDESC   = 1,     /*!< FETCHDESC : ST_FDS (Fetch Descriptor) Points to the error descriptor      */
  SDIO_ADMA_ADMAERRORSTATE_INVALID     = 2,     /*!< INVALID : Never set this state (Not used)                                 */
  SDIO_ADMA_ADMAERRORSTATE_XFERDATA    = 3,     /*!< XFERDATA : ST_TFR (Transfer Data) Points to the next of the
                                                     error descriptor                                                          */
} SDIO_ADMA_ADMAERRORSTATE_Enum;

/* =======================================================  ADMALOWD  ======================================================== */
/* =======================================================  ADMAHIWD  ======================================================== */
/* ========================================================  PRESET0  ======================================================== */
/* =========================================  SDIO PRESET0 DEFSPDRVRSTRSEL [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO_PRESET0_DEFSPDRVRSTRSEL                                              */
  SDIO_PRESET0_DEFSPDRVRSTRSEL_TYPED   = 3,     /*!< TYPED : Driver Type D is Selected                                         */
  SDIO_PRESET0_DEFSPDRVRSTRSEL_TYPEC   = 2,     /*!< TYPEC : Driver Type C is Selected                                         */
  SDIO_PRESET0_DEFSPDRVRSTRSEL_TYPEA   = 1,     /*!< TYPEA : Driver Type A is Selected                                         */
  SDIO_PRESET0_DEFSPDRVRSTRSEL_TYPEB   = 0,     /*!< TYPEB : Driver Type B is Selected                                         */
} SDIO_PRESET0_DEFSPDRVRSTRSEL_Enum;

/* =========================================  SDIO PRESET0 DEFSPCLKGENSEL [26..26]  ========================================== */
typedef enum {                                  /*!< SDIO_PRESET0_DEFSPCLKGENSEL                                               */
  SDIO_PRESET0_DEFSPCLKGENSEL_PROGCLK  = 1,     /*!< PROGCLK : Programmable Clock Generator                                    */
  SDIO_PRESET0_DEFSPCLKGENSEL_HOSTCTLR = 0,     /*!< HOSTCTLR : Host Controller Ver2.00 Compatible Clock Generator             */
} SDIO_PRESET0_DEFSPCLKGENSEL_Enum;

