lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ==============================================  TIMER CTRL11 TMR11FN [4..7]  ============================================== */
typedef enum {                                  /*!< TIMER_CTRL11_TMR11FN                                                      */
  TIMER_CTRL11_TMR11FN_CONTINUOUS      = 0,     /*!< CONTINUOUS : Continuous run (aka Free Run). Count continuously.
                                                     OUT[0]=(TIMER>CMP0), OUT[1]=(TIMER>CMP1)                                  */
  TIMER_CTRL11_TMR11FN_EDGE            = 1,     /*!< EDGE : Single run up counter generating an edge on CMP. OUT[0]=0,
                                                     counter increments to CMP0, OUT[0]=1, counter stops. OUT[1]
                                                     follows CMP1.                                                             */
  TIMER_CTRL11_TMR11FN_UPCOUNT         = 2,     /*!< UPCOUNT : Single run up counter generating a pulse on CMP. OUT[0]=0,
                                                     counter increments to CMP0, OUT[0]=1 (for one clock), timer
                                                     resets to 0, repeat. OUT[1]=1 for one cycle when CMP1 matches             */
  TIMER_CTRL11_TMR11FN_PWM             = 4,     /*!< PWM : PWM mode. OUT[0]=0, counter increments to CMP1, OUT[0]=1,
                                                     counter increments to CMP0, OUT[0]=0. Counter stops. OUT[1]=~OUT[0].      */
  TIMER_CTRL11_TMR11FN_DOWNCOUNT       = 6,     /*!< DOWNCOUNT : Counter starts at CMP0 and counts down to zero and
                                                     restarts. TMRLIMIT can create 1-255 repetitions. OUT[0]
                                                     and OUT[1] formed by TIMER>=CMPn                                          */
  TIMER_CTRL11_TMR11FN_SINGLEPATTERN   = 12,    /*!< SINGLEPATTERN : Single pattern. OUT0=CMP0[TIMER], OUT1=CMP1[TIMER].
                                                     LMT field specifies length of pattern. When LMT>32 OUT0
                                                     pattern is 64-bit pattern consisting of CMP1,CMP0 and OUT1
                                                     is CMP1,CMP1                                                              */
  TIMER_CTRL11_TMR11FN_REPEATPATTERN   = 13,    /*!< REPEATPATTERN : Repeated pattern. Like SINGLEPATTERN mode, but
                                                     pattern repeats after reaching LMT.                                       */
  TIMER_CTRL11_TMR11FN_EVENTTIMER      = 14,    /*!< EVENTTIMER : Timer uses bus clock to measure clock cycles from
                                                     trigger until next edge (rising or falling) of source clock
                                                     (used as a secondary event). This can be used to measure
                                                     time betwen GPIOs, etc.                                                   */
} TIMER_CTRL11_TMR11FN_Enum;

/* =============================================  TIMER CTRL11 TMR11POL1 [3..3]  ============================================= */
typedef enum {                                  /*!< TIMER_CTRL11_TMR11POL1                                                    */
  TIMER_CTRL11_TMR11POL1_NORMAL        = 0,     /*!< NORMAL : The polarity of the TMR11OUT1 pin is the same as the
                                                     timer output.                                                             */
  TIMER_CTRL11_TMR11POL1_INVERTED      = 1,     /*!< INVERTED : The polarity of the TMR11OUT1 pin is the inverse
                                                     of the timer output.                                                      */
} TIMER_CTRL11_TMR11POL1_Enum;

/* =============================================  TIMER CTRL11 TMR11POL0 [2..2]  ============================================= */
typedef enum {                                  /*!< TIMER_CTRL11_TMR11POL0                                                    */
  TIMER_CTRL11_TMR11POL0_NORMAL        = 0,     /*!< NORMAL : The polarity of the TMR11OUT0 pin is the same as the
                                                     timer output.                                                             */
  TIMER_CTRL11_TMR11POL0_INVERTED      = 1,     /*!< INVERTED : The polarity of the TMR11OUT0 pin is the inverse
                                                     of the timer output.                                                      */
} TIMER_CTRL11_TMR11POL0_Enum;

/* =============================================  TIMER CTRL11 TMR11CLR [1..1]  ============================================== */
typedef enum {                                  /*!< TIMER_CTRL11_TMR11CLR                                                     */
  TIMER_CTRL11_TMR11CLR_CLEAR          = 1,     /*!< CLEAR : When written to a 1, the timer will automatically be
                                                     cleared to its reset state (0 for count up counter, CMP0
                                                     for down counter)                                                         */
} TIMER_CTRL11_TMR11CLR_Enum;

/* ==============================================  TIMER CTRL11 TMR11EN [0..0]  ============================================== */
typedef enum {                                  /*!< TIMER_CTRL11_TMR11EN                                                      */
  TIMER_CTRL11_TMR11EN_DIS             = 0,     /*!< DIS : Counter/Timer 11 Disable.                                           */
  TIMER_CTRL11_TMR11EN_EN              = 1,     /*!< EN : Counter/Timer 11 Enable.                                             */
} TIMER_CTRL11_TMR11EN_Enum;

/* ========================================================  TIMER11  ======================================================== */
/* =======================================================  TMR11CMP0  ======================================================= */
/* =======================================================  TMR11CMP1  ======================================================= */
/* ========================================================  MODE11  ========================================================= */
/* ===========================================  TIMER MODE11 TMR11TRIGSEL [8..15]  =========================================== */
typedef enum {                                  /*!< TIMER_MODE11_TMR11TRIGSEL                                                 */
  TIMER_MODE11_TMR11TRIGSEL_TMR00      = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR01      = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR10      = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR11      = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR20      = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR21      = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR30      = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR31      = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR40      = 8,     /*!< TMR40 : Trigger source is TIMER 4 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR41      = 9,     /*!< TMR41 : Trigger source is TIMER 4 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR50      = 10,    /*!< TMR50 : Trigger source is TIMER 5 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR51      = 11,    /*!< TMR51 : Trigger source is TIMER 5 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR60      = 12,    /*!< TMR60 : Trigger source is TIMER 6 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR61      = 13,    /*!< TMR61 : Trigger source is TIMER 6 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR70      = 14,    /*!< TMR70 : Trigger source is TIMER 7 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR71      = 15,    /*!< TMR71 : Trigger source is TIMER 7 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR80      = 16,    /*!< TMR80 : Trigger source is TIMER 8 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR81      = 17,    /*!< TMR81 : Trigger source is TIMER 8 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR90      = 18,    /*!< TMR90 : Trigger source is TIMER 9 Output 0                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR91      = 19,    /*!< TMR91 : Trigger source is TIMER 9 Output 1                                */
  TIMER_MODE11_TMR11TRIGSEL_TMR100     = 20,    /*!< TMR100 : Trigger source is TIMER 10 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR101     = 21,    /*!< TMR101 : Trigger source is TIMER 10 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR110     = 22,    /*!< TMR110 : Trigger source is TIMER 11 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR111     = 23,    /*!< TMR111 : Trigger source is TIMER 11 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR120     = 24,    /*!< TMR120 : Trigger source is TIMER 12 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR121     = 25,    /*!< TMR121 : Trigger source is TIMER 12 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR130     = 26,    /*!< TMR130 : Trigger source is TIMER 13 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR131     = 27,    /*!< TMR131 : Trigger source is TIMER 13 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR140     = 28,    /*!< TMR140 : Trigger source is TIMER 14 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR141     = 29,    /*!< TMR141 : Trigger source is TIMER 14 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR150     = 30,    /*!< TMR150 : Trigger source is TIMER 15 Output 0                              */
  TIMER_MODE11_TMR11TRIGSEL_TMR151     = 31,    /*!< TMR151 : Trigger source is TIMER 15 Output 1                              */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP00  = 48,    /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP10  = 49,    /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP20  = 50,    /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP30  = 51,    /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP40  = 52,    /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP50  = 53,    /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP60  = 54,    /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCMP70  = 55,    /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP00  = 56,    /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP10  = 57,    /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP20  = 58,    /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP30  = 59,    /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP40  = 60,    /*!< STMRCAP40 : Trigger source is STIMER Capture 4                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP50  = 61,    /*!< STMRCAP50 : Trigger source is STIMER Capture 5                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP60  = 62,    /*!< STMRCAP60 : Trigger source is STIMER Capture 6                            */
  TIMER_MODE11_TMR11TRIGSEL_STMRCAP70  = 63,    /*!< STMRCAP70 : Trigger source is STIMER Capture 7                            */
  TIMER_MODE11_TMR11TRIGSEL_GPIO0      = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  TIMER_MODE11_TMR11TRIGSEL_GPIO127    = 255,   /*!< GPIO127 : Trigger source is GPIO #127                                     */
} TIMER_MODE11_TMR11TRIGSEL_Enum;

/* ========================================================  CTRL12  ========================================================= */
/* ===========================================  TIMER CTRL12 TMR12TMODE [16..17]  ============================================ */
typedef enum {                                  /*!< TIMER_CTRL12_TMR12TMODE                                                   */
  TIMER_CTRL12_TMR12TMODE_DIS          = 0,     /*!< DIS : Trigger not enabled                                                 */
  TIMER_CTRL12_TMR12TMODE_RISE         = 1,     /*!< RISE : Trigger on rising edge of TRIGSEL source                           */
  TIMER_CTRL12_TMR12TMODE_FALL         = 2,     /*!< FALL : Trigger on falling edge of TRIGSEL source                          */
  TIMER_CTRL12_TMR12TMODE_BOTH         = 3,     /*!< BOTH : Trigger on either edge of TRIGSEL source                           */
} TIMER_CTRL12_TMR12TMODE_Enum;

