lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* ==============================================  USB CFG2 EP5OutIntEn [5..5]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP5OutIntEn                                                      */
  USB_CFG2_EP5OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP5OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP5OutIntEn_Enum;

/* ==============================================  USB CFG2 EP4OutIntEn [4..4]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP4OutIntEn                                                      */
  USB_CFG2_EP4OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP4OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP4OutIntEn_Enum;

/* ==============================================  USB CFG2 EP3OutIntEn [3..3]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP3OutIntEn                                                      */
  USB_CFG2_EP3OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP3OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP3OutIntEn_Enum;

/* ==============================================  USB CFG2 EP2OutIntEn [2..2]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP2OutIntEn                                                      */
  USB_CFG2_EP2OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP2OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP2OutIntEn_Enum;

/* ==============================================  USB CFG2 EP1OutIntEn [1..1]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP1OutIntEn                                                      */
  USB_CFG2_EP1OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP1OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP1OutIntEn_Enum;

/* ==============================================  USB CFG2 EP0OutIntEn [0..0]  ============================================== */
typedef enum {                                  /*!< USB_CFG2_EP0OutIntEn                                                      */
  USB_CFG2_EP0OutIntEn_DIS             = 0,     /*!< DIS : Out Endpoint interrupt disabled.                                    */
  USB_CFG2_EP0OutIntEn_EN              = 1,     /*!< EN : Out Endpoint interrupt enabled.                                      */
} USB_CFG2_EP0OutIntEn_Enum;

/* =========================================================  CFG3  ========================================================== */
/* ===============================================  USB CFG3 ForceFS [29..29]  =============================================== */
typedef enum {                                  /*!< USB_CFG3_ForceFS                                                          */
  USB_CFG3_ForceFS_FS_NOT_FORCED       = 0,     /*!< FS_NOT_FORCED : Do not force FS mode upon USB reset.                      */
  USB_CFG3_ForceFS_FS_FORCED           = 1,     /*!< FS_FORCED : Force FS mode upon USB reset.                                 */
} USB_CFG3_ForceFS_Enum;

/* ===============================================  USB CFG3 ForceHS [28..28]  =============================================== */
typedef enum {                                  /*!< USB_CFG3_ForceHS                                                          */
  USB_CFG3_ForceHS_HS_NOT_FORCED       = 0,     /*!< HS_NOT_FORCED : Do not force HS mode upon USB reset.                      */
  USB_CFG3_ForceHS_HS_FORCED           = 1,     /*!< HS_FORCED : Force HS mode upon USB reset.                                 */
} USB_CFG3_ForceHS_Enum;

/* =============================================  USB CFG3 TestPacket [27..27]  ============================================== */
typedef enum {                                  /*!< USB_CFG3_TestPacket                                                       */
  USB_CFG3_TestPacket_STOP_TPTM        = 0,     /*!< STOP_TPTM : Terminates Test Packet Test Mode.                             */
  USB_CFG3_TestPacket_START_TPTM       = 1,     /*!< START_TPTM : Initiates Test Packet Test Mode.                             */
} USB_CFG3_TestPacket_Enum;

/* ================================================  USB CFG3 TestK [26..26]  ================================================ */
typedef enum {                                  /*!< USB_CFG3_TestK                                                            */
  USB_CFG3_TestK_STOP_TESTK            = 0,     /*!< STOP_TESTK : Terminates Test_K Test Mode.                                 */
  USB_CFG3_TestK_START_TESTK           = 1,     /*!< START_TESTK : Initiates Test_K Test Mode.                                 */
} USB_CFG3_TestK_Enum;

/* ================================================  USB CFG3 TestJ [25..25]  ================================================ */
typedef enum {                                  /*!< USB_CFG3_TestJ                                                            */
  USB_CFG3_TestJ_STOP_TESTJ            = 0,     /*!< STOP_TESTJ : Terminates Test_J Test Mode.                                 */
  USB_CFG3_TestJ_START_TESTJ           = 1,     /*!< START_TESTJ : Initiates Test_J Test Mode.                                 */
} USB_CFG3_TestJ_Enum;

/* =============================================  USB CFG3 TestSE0NAK [24..24]  ============================================== */
typedef enum {                                  /*!< USB_CFG3_TestSE0NAK                                                       */
  USB_CFG3_TestSE0NAK_STOP_TESTSE0NAK  = 0,     /*!< STOP_TESTSE0NAK : Terminates Test_SE0_NAK Test Mode.                      */
  USB_CFG3_TestSE0NAK_START_TESTSE0NAK = 1,     /*!< START_TESTSE0NAK : Initiates Test_SE0_NAK Test Mode.                      */
} USB_CFG3_TestSE0NAK_Enum;

