lilihang123/AB162XM_project/modules/hal/ambiq/CMSIS/AmbiqMicro/Include/apollo4b_generic.h
/* =========================================================  IDX2  ========================================================== */
/* ========================================================  FIFOADD  ======================================================== */
/* =========================================================  FIFO0  ========================================================= */
/* =========================================================  FIFO1  ========================================================= */
/* =========================================================  FIFO2  ========================================================= */
/* =========================================================  FIFO3  ========================================================= */
/* =========================================================  FIFO4  ========================================================= */
/* =========================================================  FIFO5  ========================================================= */
/* ========================================================  HWVERS  ========================================================= */
/* =========================================================  INFO  ========================================================== */
/* =======================================================  TIMEOUT1  ======================================================== */
/* =======================================================  TIMEOUT2  ======================================================== */
/* ========================================================  CLKCTRL  ======================================================== */
/* ===========================================  USB CLKCTRL PHYREFCLKSEL [24..25]  =========================================== */
typedef enum {                                  /*!< USB_CLKCTRL_PHYREFCLKSEL                                                  */
  USB_CLKCTRL_PHYREFCLKSEL_HFRC48      = 0,     /*!< HFRC48 : 48 MHz HFRC-based reference clock for Full-Speed Mode            */
  USB_CLKCTRL_PHYREFCLKSEL_HFRC248     = 1,     /*!< HFRC248 : 48 MHz HFRC2-based reference clock for High-Speed
                                                     Mode                                                                      */
  USB_CLKCTRL_PHYREFCLKSEL_HFRC24      = 2,     /*!< HFRC24 : 24 MHz HFRC-based reference clock for Full-Speed Mode            */
} USB_CLKCTRL_PHYREFCLKSEL_Enum;

/* =======================================================  SRAMCTRL  ======================================================== */
/* ===============================================  USB SRAMCTRL RAWLM [7..8]  =============================================== */
typedef enum {                                  /*!< USB_SRAMCTRL_RAWLM                                                        */
  USB_SRAMCTRL_RAWLM_INCDLY            = 3,     /*!< INCDLY : Increased margin adjustment, increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_MBINCDLY          = 2,     /*!< MBINCDLY : Minimum boost level with increased delay for enabling
                                                     write assist.                                                             */
  USB_SRAMCTRL_RAWLM_IMNB              = 1,     /*!< IMNB : Increased margin adjustment with more negative boost.              */
  USB_SRAMCTRL_RAWLM_MMNB              = 0,     /*!< MMNB : Minimum margin adjustment with lowest negative boost
                                                     level.                                                                    */
} USB_SRAMCTRL_RAWLM_Enum;

/* ===================================================  UTMISTICKYSTATUS  ==================================================== */
/* =======================================  USB UTMISTICKYSTATUS obsportstciky [0..1]  ======================================= */
typedef enum {                                  /*!< USB_UTMISTICKYSTATUS_obsportstciky                                        */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS3 = 3,  /*!< OBS3 : bit 1:HS BIST results, bit 0:FS BIST results                       */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS2 = 2,  /*!< OBS2 : bit 1: ODT calibration state, bit 0: Current calibration
                                                     state                                                                     */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS1 = 1,  /*!< OBS1 : bit 1: Rx squelch signal, bit 0: Rx datap                          */
  USB_UTMISTICKYSTATUS_obsportstciky_OBS0 = 0,  /*!< OBS0 : bit 1: PLL lock signal, bit 0: Host Disconnect                     */
} USB_UTMISTICKYSTATUS_obsportstciky_Enum;

/* ======================================================  OBSCLRSTAT  ======================================================= */
/* =====================================================  DPDMPULLDOWN  ====================================================== */
/* ======================================================  BCDETSTATUS  ====================================================== */
/* ======================================================  BCDETCRTL1  ======================================================= */
/* ===========================================  USB BCDETCRTL1 USBDCOMPREF [8..9]  =========================================== */
typedef enum {                                  /*!< USB_BCDETCRTL1_USBDCOMPREF                                                */
  USB_BCDETCRTL1_USBDCOMPREF_1P25V     = 3,     /*!< 1P25V : 1.25V                                                             */
  USB_BCDETCRTL1_USBDCOMPREF_2P35      = 2,     /*!< 2P35 : 2.35V                                                              */
  USB_BCDETCRTL1_USBDCOMPREF_3P10V     = 1,     /*!< 3P10V : 3.10V                                                             */
  USB_BCDETCRTL1_USBDCOMPREF_1P65      = 0,     /*!< 1P65 : 1.65V (VCCIO/2)                                                    */
} USB_BCDETCRTL1_USBDCOMPREF_Enum;

/* ======================================================  BCDETCRTL2  ======================================================= */


/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  CFG  ========================================================== */
/* ===============================================  VCOMP CFG LVLSEL [16..19]  =============================================== */
typedef enum {                                  /*!< VCOMP_CFG_LVLSEL                                                          */
  VCOMP_CFG_LVLSEL_0P58V               = 0,     /*!< 0P58V : Set Reference input to 0.58 Volts.                                */
  VCOMP_CFG_LVLSEL_0P77V               = 1,     /*!< 0P77V : Set Reference input to 0.77 Volts.                                */
  VCOMP_CFG_LVLSEL_0P97V               = 2,     /*!< 0P97V : Set Reference input to 0.97 Volts.                                */
  VCOMP_CFG_LVLSEL_1P16V               = 3,     /*!< 1P16V : Set Reference input to 1.16 Volts.                                */
  VCOMP_CFG_LVLSEL_1P35V               = 4,     /*!< 1P35V : Set Reference input to 1.35 Volts.                                */
  VCOMP_CFG_LVLSEL_1P55V               = 5,     /*!< 1P55V : Set Reference input to 1.55 Volts.                                */
  VCOMP_CFG_LVLSEL_1P74V               = 6,     /*!< 1P74V : Set Reference input to 1.74 Volts.                                */
  VCOMP_CFG_LVLSEL_1P93V               = 7,     /*!< 1P93V : Set Reference input to 1.93 Volts.                                */
  VCOMP_CFG_LVLSEL_2P13V               = 8,     /*!< 2P13V : Set Reference input to 2.13 Volts.                                */
  VCOMP_CFG_LVLSEL_2P32V               = 9,     /*!< 2P32V : Set Reference input to 2.32 Volts.                                */
  VCOMP_CFG_LVLSEL_2P51V               = 10,    /*!< 2P51V : Set Reference input to 2.51 Volts.                                */
  VCOMP_CFG_LVLSEL_2P71V               = 11,    /*!< 2P71V : Set Reference input to 2.71 Volts.                                */
  VCOMP_CFG_LVLSEL_2P90V               = 12,    /*!< 2P90V : Set Reference input to 2.90 Volts.                                */
  VCOMP_CFG_LVLSEL_3P09V               = 13,    /*!< 3P09V : Set Reference input to 3.09 Volts.                                */
  VCOMP_CFG_LVLSEL_3P29V               = 14,    /*!< 3P29V : Set Reference input to 3.29 Volts.                                */
  VCOMP_CFG_LVLSEL_3P48V               = 15,    /*!< 3P48V : Set Reference input to 3.48 Volts.                                */
} VCOMP_CFG_LVLSEL_Enum;

/* =================================================  VCOMP CFG NSEL [8..9]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_NSEL                                                            */
  VCOMP_CFG_NSEL_VREFEXT1              = 0,     /*!< VREFEXT1 : Use external reference 1 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT2              = 1,     /*!< VREFEXT2 : Use external reference 2 for reference input.                  */
  VCOMP_CFG_NSEL_VREFEXT3              = 2,     /*!< VREFEXT3 : Use external reference 3 for reference input.                  */
  VCOMP_CFG_NSEL_DAC                   = 3,     /*!< DAC : Use DAC output selected by LVLSEL for reference input.              */
} VCOMP_CFG_NSEL_Enum;

/* =================================================  VCOMP CFG PSEL [0..1]  ================================================= */
typedef enum {                                  /*!< VCOMP_CFG_PSEL                                                            */
  VCOMP_CFG_PSEL_VDDADJ                = 0,     /*!< VDDADJ : Use VDDADJ for the positive input.                               */
  VCOMP_CFG_PSEL_VTEMP                 = 1,     /*!< VTEMP : Use the temperature sensor output for the positive input.
                                                     Note: If this channel is selected for PSEL, the bandap
                                                     circuit required for temperature comparisons will automatically
                                                     turn on. The bandgap circuit requires 11us to stabalize.                  */
  VCOMP_CFG_PSEL_VEXT1                 = 2,     /*!< VEXT1 : Use external voltage 0 for positive input.                        */
  VCOMP_CFG_PSEL_VEXT2                 = 3,     /*!< VEXT2 : Use external voltage 1 for positive input.                        */
} VCOMP_CFG_PSEL_Enum;

/* =========================================================  STAT  ========================================================== */
/* ===============================================  VCOMP STAT PWDSTAT [1..1]  =============================================== */
typedef enum {                                  /*!< VCOMP_STAT_PWDSTAT                                                        */
  VCOMP_STAT_PWDSTAT_POWERED_DOWN      = 1,     /*!< POWERED_DOWN : The voltage comparator is powered down.                    */
} VCOMP_STAT_PWDSTAT_Enum;

